/* automatically generated by rust-bindgen 0.65.1 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 31;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __LONG_DOUBLE_USES_FLOAT128: u32 = 0;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT_C2X: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT_C2X: u32 = 0;
pub const __GLIBC_USE_IEC_60559_TYPES_EXT: u32 = 0;
pub const _BITS_TYPES_H: u32 = 1;
pub const __TIMESIZE: u32 = 64;
pub const _BITS_TYPESIZES_H: u32 = 1;
pub const __OFF_T_MATCHES_OFF64_T: u32 = 1;
pub const __INO_T_MATCHES_INO64_T: u32 = 1;
pub const __RLIM_T_MATCHES_RLIM64_T: u32 = 1;
pub const __STATFS_MATCHES_STATFS64: u32 = 1;
pub const __FD_SETSIZE: u32 = 1024;
pub const _BITS_TIME64_H: u32 = 1;
pub const _BITS_WCHAR_H: u32 = 1;
pub const _BITS_STDINT_INTN_H: u32 = 1;
pub const _BITS_STDINT_UINTN_H: u32 = 1;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type char32_t = u32;
pub type char16_t = u16;
pub const GDEXTENSION_VARIANT_TYPE_NIL: GDExtensionVariantType = 0;
pub const GDEXTENSION_VARIANT_TYPE_BOOL: GDExtensionVariantType = 1;
pub const GDEXTENSION_VARIANT_TYPE_INT: GDExtensionVariantType = 2;
pub const GDEXTENSION_VARIANT_TYPE_FLOAT: GDExtensionVariantType = 3;
pub const GDEXTENSION_VARIANT_TYPE_STRING: GDExtensionVariantType = 4;
pub const GDEXTENSION_VARIANT_TYPE_VECTOR2: GDExtensionVariantType = 5;
pub const GDEXTENSION_VARIANT_TYPE_VECTOR2I: GDExtensionVariantType = 6;
pub const GDEXTENSION_VARIANT_TYPE_RECT2: GDExtensionVariantType = 7;
pub const GDEXTENSION_VARIANT_TYPE_RECT2I: GDExtensionVariantType = 8;
pub const GDEXTENSION_VARIANT_TYPE_VECTOR3: GDExtensionVariantType = 9;
pub const GDEXTENSION_VARIANT_TYPE_VECTOR3I: GDExtensionVariantType = 10;
pub const GDEXTENSION_VARIANT_TYPE_TRANSFORM2D: GDExtensionVariantType = 11;
pub const GDEXTENSION_VARIANT_TYPE_VECTOR4: GDExtensionVariantType = 12;
pub const GDEXTENSION_VARIANT_TYPE_VECTOR4I: GDExtensionVariantType = 13;
pub const GDEXTENSION_VARIANT_TYPE_PLANE: GDExtensionVariantType = 14;
pub const GDEXTENSION_VARIANT_TYPE_QUATERNION: GDExtensionVariantType = 15;
pub const GDEXTENSION_VARIANT_TYPE_AABB: GDExtensionVariantType = 16;
pub const GDEXTENSION_VARIANT_TYPE_BASIS: GDExtensionVariantType = 17;
pub const GDEXTENSION_VARIANT_TYPE_TRANSFORM3D: GDExtensionVariantType = 18;
pub const GDEXTENSION_VARIANT_TYPE_PROJECTION: GDExtensionVariantType = 19;
pub const GDEXTENSION_VARIANT_TYPE_COLOR: GDExtensionVariantType = 20;
pub const GDEXTENSION_VARIANT_TYPE_STRING_NAME: GDExtensionVariantType = 21;
pub const GDEXTENSION_VARIANT_TYPE_NODE_PATH: GDExtensionVariantType = 22;
pub const GDEXTENSION_VARIANT_TYPE_RID: GDExtensionVariantType = 23;
pub const GDEXTENSION_VARIANT_TYPE_OBJECT: GDExtensionVariantType = 24;
pub const GDEXTENSION_VARIANT_TYPE_CALLABLE: GDExtensionVariantType = 25;
pub const GDEXTENSION_VARIANT_TYPE_SIGNAL: GDExtensionVariantType = 26;
pub const GDEXTENSION_VARIANT_TYPE_DICTIONARY: GDExtensionVariantType = 27;
pub const GDEXTENSION_VARIANT_TYPE_ARRAY: GDExtensionVariantType = 28;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_BYTE_ARRAY: GDExtensionVariantType = 29;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_INT32_ARRAY: GDExtensionVariantType = 30;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_INT64_ARRAY: GDExtensionVariantType = 31;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_FLOAT32_ARRAY: GDExtensionVariantType = 32;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_FLOAT64_ARRAY: GDExtensionVariantType = 33;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_STRING_ARRAY: GDExtensionVariantType = 34;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_VECTOR2_ARRAY: GDExtensionVariantType = 35;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_VECTOR3_ARRAY: GDExtensionVariantType = 36;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_COLOR_ARRAY: GDExtensionVariantType = 37;
pub const GDEXTENSION_VARIANT_TYPE_VARIANT_MAX: GDExtensionVariantType = 38;
pub type GDExtensionVariantType = ::std::os::raw::c_uint;
pub const GDEXTENSION_VARIANT_OP_EQUAL: GDExtensionVariantOperator = 0;
pub const GDEXTENSION_VARIANT_OP_NOT_EQUAL: GDExtensionVariantOperator = 1;
pub const GDEXTENSION_VARIANT_OP_LESS: GDExtensionVariantOperator = 2;
pub const GDEXTENSION_VARIANT_OP_LESS_EQUAL: GDExtensionVariantOperator = 3;
pub const GDEXTENSION_VARIANT_OP_GREATER: GDExtensionVariantOperator = 4;
pub const GDEXTENSION_VARIANT_OP_GREATER_EQUAL: GDExtensionVariantOperator = 5;
pub const GDEXTENSION_VARIANT_OP_ADD: GDExtensionVariantOperator = 6;
pub const GDEXTENSION_VARIANT_OP_SUBTRACT: GDExtensionVariantOperator = 7;
pub const GDEXTENSION_VARIANT_OP_MULTIPLY: GDExtensionVariantOperator = 8;
pub const GDEXTENSION_VARIANT_OP_DIVIDE: GDExtensionVariantOperator = 9;
pub const GDEXTENSION_VARIANT_OP_NEGATE: GDExtensionVariantOperator = 10;
pub const GDEXTENSION_VARIANT_OP_POSITIVE: GDExtensionVariantOperator = 11;
pub const GDEXTENSION_VARIANT_OP_MODULE: GDExtensionVariantOperator = 12;
pub const GDEXTENSION_VARIANT_OP_POWER: GDExtensionVariantOperator = 13;
pub const GDEXTENSION_VARIANT_OP_SHIFT_LEFT: GDExtensionVariantOperator = 14;
pub const GDEXTENSION_VARIANT_OP_SHIFT_RIGHT: GDExtensionVariantOperator = 15;
pub const GDEXTENSION_VARIANT_OP_BIT_AND: GDExtensionVariantOperator = 16;
pub const GDEXTENSION_VARIANT_OP_BIT_OR: GDExtensionVariantOperator = 17;
pub const GDEXTENSION_VARIANT_OP_BIT_XOR: GDExtensionVariantOperator = 18;
pub const GDEXTENSION_VARIANT_OP_BIT_NEGATE: GDExtensionVariantOperator = 19;
pub const GDEXTENSION_VARIANT_OP_AND: GDExtensionVariantOperator = 20;
pub const GDEXTENSION_VARIANT_OP_OR: GDExtensionVariantOperator = 21;
pub const GDEXTENSION_VARIANT_OP_XOR: GDExtensionVariantOperator = 22;
pub const GDEXTENSION_VARIANT_OP_NOT: GDExtensionVariantOperator = 23;
pub const GDEXTENSION_VARIANT_OP_IN: GDExtensionVariantOperator = 24;
pub const GDEXTENSION_VARIANT_OP_MAX: GDExtensionVariantOperator = 25;
pub type GDExtensionVariantOperator = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextVariant {
    _unused: [u8; 0],
}
pub type GDExtensionVariantPtr = *mut __GdextVariant;
pub type GDExtensionConstVariantPtr = *const __GdextVariant;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextUninitializedVariant {
    _unused: [u8; 0],
}
pub type GDExtensionUninitializedVariantPtr = *mut __GdextUninitializedVariant;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextStringName {
    _unused: [u8; 0],
}
pub type GDExtensionStringNamePtr = *mut __GdextStringName;
pub type GDExtensionConstStringNamePtr = *const __GdextStringName;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextUninitializedStringName {
    _unused: [u8; 0],
}
pub type GDExtensionUninitializedStringNamePtr = *mut __GdextUninitializedStringName;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextString {
    _unused: [u8; 0],
}
pub type GDExtensionStringPtr = *mut __GdextString;
pub type GDExtensionConstStringPtr = *const __GdextString;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextUninitializedString {
    _unused: [u8; 0],
}
pub type GDExtensionUninitializedStringPtr = *mut __GdextUninitializedString;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextObject {
    _unused: [u8; 0],
}
pub type GDExtensionObjectPtr = *mut __GdextObject;
pub type GDExtensionConstObjectPtr = *const __GdextObject;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextUninitializedObject {
    _unused: [u8; 0],
}
pub type GDExtensionUninitializedObjectPtr = *mut __GdextUninitializedObject;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextType {
    _unused: [u8; 0],
}
pub type GDExtensionTypePtr = *mut __GdextType;
pub type GDExtensionConstTypePtr = *const __GdextType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextUninitializedType {
    _unused: [u8; 0],
}
pub type GDExtensionUninitializedTypePtr = *mut __GdextUninitializedType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextMethodBind {
    _unused: [u8; 0],
}
pub type GDExtensionMethodBindPtr = *const __GdextMethodBind;
pub type GDExtensionInt = i64;
pub type GDExtensionBool = u8;
pub type GDObjectInstanceID = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextRef {
    _unused: [u8; 0],
}
pub type GDExtensionRefPtr = *mut __GdextRef;
pub type GDExtensionConstRefPtr = *const __GdextRef;
pub const GDEXTENSION_CALL_OK: GDExtensionCallErrorType = 0;
pub const GDEXTENSION_CALL_ERROR_INVALID_METHOD: GDExtensionCallErrorType = 1;
pub const GDEXTENSION_CALL_ERROR_INVALID_ARGUMENT: GDExtensionCallErrorType = 2;
pub const GDEXTENSION_CALL_ERROR_TOO_MANY_ARGUMENTS: GDExtensionCallErrorType = 3;
pub const GDEXTENSION_CALL_ERROR_TOO_FEW_ARGUMENTS: GDExtensionCallErrorType = 4;
pub const GDEXTENSION_CALL_ERROR_INSTANCE_IS_NULL: GDExtensionCallErrorType = 5;
pub const GDEXTENSION_CALL_ERROR_METHOD_NOT_CONST: GDExtensionCallErrorType = 6;
pub type GDExtensionCallErrorType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionCallError {
    pub error: GDExtensionCallErrorType,
    pub argument: i32,
    pub expected: i32,
}
#[test]
fn bindgen_test_layout_GDExtensionCallError() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionCallError> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionCallError>(),
        12usize,
        concat!("Size of: ", stringify!(GDExtensionCallError))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionCallError>(),
        4usize,
        concat!("Alignment of ", stringify!(GDExtensionCallError))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallError),
            "::",
            stringify!(error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argument) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallError),
            "::",
            stringify!(argument)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).expected) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallError),
            "::",
            stringify!(expected)
        )
    );
}
pub type GDExtensionVariantFromTypeConstructorFunc = ::std::option::Option<
    unsafe extern "C" fn(arg1: GDExtensionUninitializedVariantPtr, arg2: GDExtensionTypePtr),
>;
pub type GDExtensionTypeFromVariantConstructorFunc = ::std::option::Option<
    unsafe extern "C" fn(arg1: GDExtensionUninitializedTypePtr, arg2: GDExtensionVariantPtr),
>;
pub type GDExtensionPtrOperatorEvaluator = ::std::option::Option<
    unsafe extern "C" fn(
        p_left: GDExtensionConstTypePtr,
        p_right: GDExtensionConstTypePtr,
        r_result: GDExtensionTypePtr,
    ),
>;
pub type GDExtensionPtrBuiltInMethod = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionTypePtr,
        p_args: *const GDExtensionConstTypePtr,
        r_return: GDExtensionTypePtr,
        p_argument_count: ::std::os::raw::c_int,
    ),
>;
pub type GDExtensionPtrConstructor = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionUninitializedTypePtr,
        p_args: *const GDExtensionConstTypePtr,
    ),
>;
pub type GDExtensionPtrDestructor =
    ::std::option::Option<unsafe extern "C" fn(p_base: GDExtensionTypePtr)>;
pub type GDExtensionPtrSetter = ::std::option::Option<
    unsafe extern "C" fn(p_base: GDExtensionTypePtr, p_value: GDExtensionConstTypePtr),
>;
pub type GDExtensionPtrGetter = ::std::option::Option<
    unsafe extern "C" fn(p_base: GDExtensionConstTypePtr, r_value: GDExtensionTypePtr),
>;
pub type GDExtensionPtrIndexedSetter = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionTypePtr,
        p_index: GDExtensionInt,
        p_value: GDExtensionConstTypePtr,
    ),
>;
pub type GDExtensionPtrIndexedGetter = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionConstTypePtr,
        p_index: GDExtensionInt,
        r_value: GDExtensionTypePtr,
    ),
>;
pub type GDExtensionPtrKeyedSetter = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionTypePtr,
        p_key: GDExtensionConstTypePtr,
        p_value: GDExtensionConstTypePtr,
    ),
>;
pub type GDExtensionPtrKeyedGetter = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionConstTypePtr,
        p_key: GDExtensionConstTypePtr,
        r_value: GDExtensionTypePtr,
    ),
>;
pub type GDExtensionPtrKeyedChecker = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionConstVariantPtr,
        p_key: GDExtensionConstVariantPtr,
    ) -> u32,
>;
pub type GDExtensionPtrUtilityFunction = ::std::option::Option<
    unsafe extern "C" fn(
        r_return: GDExtensionTypePtr,
        p_args: *const GDExtensionConstTypePtr,
        p_argument_count: ::std::os::raw::c_int,
    ),
>;
pub type GDExtensionClassConstructor =
    ::std::option::Option<unsafe extern "C" fn() -> GDExtensionObjectPtr>;
pub type GDExtensionInstanceBindingCreateCallback = ::std::option::Option<
    unsafe extern "C" fn(
        p_token: *mut ::std::os::raw::c_void,
        p_instance: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type GDExtensionInstanceBindingFreeCallback = ::std::option::Option<
    unsafe extern "C" fn(
        p_token: *mut ::std::os::raw::c_void,
        p_instance: *mut ::std::os::raw::c_void,
        p_binding: *mut ::std::os::raw::c_void,
    ),
>;
pub type GDExtensionInstanceBindingReferenceCallback = ::std::option::Option<
    unsafe extern "C" fn(
        p_token: *mut ::std::os::raw::c_void,
        p_binding: *mut ::std::os::raw::c_void,
        p_reference: GDExtensionBool,
    ) -> GDExtensionBool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionInstanceBindingCallbacks {
    pub create_callback: GDExtensionInstanceBindingCreateCallback,
    pub free_callback: GDExtensionInstanceBindingFreeCallback,
    pub reference_callback: GDExtensionInstanceBindingReferenceCallback,
}
#[test]
fn bindgen_test_layout_GDExtensionInstanceBindingCallbacks() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionInstanceBindingCallbacks> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionInstanceBindingCallbacks>(),
        24usize,
        concat!("Size of: ", stringify!(GDExtensionInstanceBindingCallbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionInstanceBindingCallbacks>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(GDExtensionInstanceBindingCallbacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create_callback) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInstanceBindingCallbacks),
            "::",
            stringify!(create_callback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_callback) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInstanceBindingCallbacks),
            "::",
            stringify!(free_callback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_callback) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInstanceBindingCallbacks),
            "::",
            stringify!(reference_callback)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextClassInstance {
    _unused: [u8; 0],
}
pub type GDExtensionClassInstancePtr = *mut __GdextClassInstance;
pub type GDExtensionClassSet = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_name: GDExtensionConstStringNamePtr,
        p_value: GDExtensionConstVariantPtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionClassGet = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_name: GDExtensionConstStringNamePtr,
        r_ret: GDExtensionVariantPtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionClassGetRID =
    ::std::option::Option<unsafe extern "C" fn(p_instance: GDExtensionClassInstancePtr) -> u64>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionPropertyInfo {
    pub type_: GDExtensionVariantType,
    pub name: GDExtensionStringNamePtr,
    pub class_name: GDExtensionStringNamePtr,
    pub hint: u32,
    pub hint_string: GDExtensionStringPtr,
    pub usage: u32,
}
#[test]
fn bindgen_test_layout_GDExtensionPropertyInfo() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionPropertyInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionPropertyInfo>(),
        48usize,
        concat!("Size of: ", stringify!(GDExtensionPropertyInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionPropertyInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionPropertyInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionPropertyInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionPropertyInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).class_name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionPropertyInfo),
            "::",
            stringify!(class_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hint) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionPropertyInfo),
            "::",
            stringify!(hint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hint_string) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionPropertyInfo),
            "::",
            stringify!(hint_string)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).usage) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionPropertyInfo),
            "::",
            stringify!(usage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionMethodInfo {
    pub name: GDExtensionStringNamePtr,
    pub return_value: GDExtensionPropertyInfo,
    pub flags: u32,
    pub id: i32,
    pub argument_count: u32,
    pub arguments: *mut GDExtensionPropertyInfo,
    pub default_argument_count: u32,
    pub default_arguments: *mut GDExtensionVariantPtr,
}
#[test]
fn bindgen_test_layout_GDExtensionMethodInfo() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionMethodInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionMethodInfo>(),
        96usize,
        concat!("Size of: ", stringify!(GDExtensionMethodInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionMethodInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionMethodInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(return_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argument_count) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(argument_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arguments) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(arguments)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_argument_count) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(default_argument_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_arguments) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(default_arguments)
        )
    );
}
pub type GDExtensionClassGetPropertyList = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        r_count: *mut u32,
    ) -> *const GDExtensionPropertyInfo,
>;
pub type GDExtensionClassFreePropertyList = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_list: *const GDExtensionPropertyInfo,
    ),
>;
pub type GDExtensionClassPropertyCanRevert = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_name: GDExtensionConstStringNamePtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionClassPropertyGetRevert = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_name: GDExtensionConstStringNamePtr,
        r_ret: GDExtensionVariantPtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionClassValidateProperty = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_property: *mut GDExtensionPropertyInfo,
    ) -> GDExtensionBool,
>;
pub type GDExtensionClassNotification = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionClassInstancePtr, p_what: i32),
>;
pub type GDExtensionClassNotification2 = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_what: i32,
        p_reversed: GDExtensionBool,
    ),
>;
pub type GDExtensionClassToString = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        r_is_valid: *mut GDExtensionBool,
        p_out: GDExtensionStringPtr,
    ),
>;
pub type GDExtensionClassReference =
    ::std::option::Option<unsafe extern "C" fn(p_instance: GDExtensionClassInstancePtr)>;
pub type GDExtensionClassUnreference =
    ::std::option::Option<unsafe extern "C" fn(p_instance: GDExtensionClassInstancePtr)>;
pub type GDExtensionClassCallVirtual = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_args: *const GDExtensionConstTypePtr,
        r_ret: GDExtensionTypePtr,
    ),
>;
pub type GDExtensionClassCreateInstance = ::std::option::Option<
    unsafe extern "C" fn(p_class_userdata: *mut ::std::os::raw::c_void) -> GDExtensionObjectPtr,
>;
pub type GDExtensionClassFreeInstance = ::std::option::Option<
    unsafe extern "C" fn(
        p_class_userdata: *mut ::std::os::raw::c_void,
        p_instance: GDExtensionClassInstancePtr,
    ),
>;
pub type GDExtensionClassRecreateInstance = ::std::option::Option<
    unsafe extern "C" fn(
        p_class_userdata: *mut ::std::os::raw::c_void,
        p_object: GDExtensionObjectPtr,
    ) -> GDExtensionClassInstancePtr,
>;
pub type GDExtensionClassGetVirtual = ::std::option::Option<
    unsafe extern "C" fn(
        p_class_userdata: *mut ::std::os::raw::c_void,
        p_name: GDExtensionConstStringNamePtr,
    ) -> GDExtensionClassCallVirtual,
>;
pub type GDExtensionClassGetVirtualCallData = ::std::option::Option<
    unsafe extern "C" fn(
        p_class_userdata: *mut ::std::os::raw::c_void,
        p_name: GDExtensionConstStringNamePtr,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type GDExtensionClassCallVirtualWithData = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_name: GDExtensionConstStringNamePtr,
        p_virtual_call_userdata: *mut ::std::os::raw::c_void,
        p_args: *const GDExtensionConstTypePtr,
        r_ret: GDExtensionTypePtr,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionClassCreationInfo {
    pub is_virtual: GDExtensionBool,
    pub is_abstract: GDExtensionBool,
    pub set_func: GDExtensionClassSet,
    pub get_func: GDExtensionClassGet,
    pub get_property_list_func: GDExtensionClassGetPropertyList,
    pub free_property_list_func: GDExtensionClassFreePropertyList,
    pub property_can_revert_func: GDExtensionClassPropertyCanRevert,
    pub property_get_revert_func: GDExtensionClassPropertyGetRevert,
    pub notification_func: GDExtensionClassNotification,
    pub to_string_func: GDExtensionClassToString,
    pub reference_func: GDExtensionClassReference,
    pub unreference_func: GDExtensionClassUnreference,
    pub create_instance_func: GDExtensionClassCreateInstance,
    pub free_instance_func: GDExtensionClassFreeInstance,
    pub get_virtual_func: GDExtensionClassGetVirtual,
    pub get_rid_func: GDExtensionClassGetRID,
    pub class_userdata: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_GDExtensionClassCreationInfo() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionClassCreationInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionClassCreationInfo>(),
        128usize,
        concat!("Size of: ", stringify!(GDExtensionClassCreationInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionClassCreationInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionClassCreationInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_virtual) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(is_virtual)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_abstract) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(is_abstract)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(set_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(get_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_property_list_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(get_property_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_property_list_func) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(free_property_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_can_revert_func) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(property_can_revert_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_get_revert_func) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(property_get_revert_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).notification_func) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(notification_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_string_func) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(to_string_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_func) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(reference_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unreference_func) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(unreference_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create_instance_func) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(create_instance_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_instance_func) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(free_instance_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_virtual_func) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(get_virtual_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_rid_func) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(get_rid_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).class_userdata) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(class_userdata)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionClassCreationInfo2 {
    pub is_virtual: GDExtensionBool,
    pub is_abstract: GDExtensionBool,
    pub is_exposed: GDExtensionBool,
    pub set_func: GDExtensionClassSet,
    pub get_func: GDExtensionClassGet,
    pub get_property_list_func: GDExtensionClassGetPropertyList,
    pub free_property_list_func: GDExtensionClassFreePropertyList,
    pub property_can_revert_func: GDExtensionClassPropertyCanRevert,
    pub property_get_revert_func: GDExtensionClassPropertyGetRevert,
    pub validate_property_func: GDExtensionClassValidateProperty,
    pub notification_func: GDExtensionClassNotification2,
    pub to_string_func: GDExtensionClassToString,
    pub reference_func: GDExtensionClassReference,
    pub unreference_func: GDExtensionClassUnreference,
    pub create_instance_func: GDExtensionClassCreateInstance,
    pub free_instance_func: GDExtensionClassFreeInstance,
    pub recreate_instance_func: GDExtensionClassRecreateInstance,
    pub get_virtual_func: GDExtensionClassGetVirtual,
    pub get_virtual_call_data_func: GDExtensionClassGetVirtualCallData,
    pub call_virtual_with_data_func: GDExtensionClassCallVirtualWithData,
    pub get_rid_func: GDExtensionClassGetRID,
    pub class_userdata: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_GDExtensionClassCreationInfo2() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionClassCreationInfo2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionClassCreationInfo2>(),
        160usize,
        concat!("Size of: ", stringify!(GDExtensionClassCreationInfo2))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionClassCreationInfo2>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionClassCreationInfo2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_virtual) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(is_virtual)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_abstract) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(is_abstract)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_exposed) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(is_exposed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(set_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(get_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_property_list_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(get_property_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_property_list_func) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(free_property_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_can_revert_func) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(property_can_revert_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_get_revert_func) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(property_get_revert_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).validate_property_func) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(validate_property_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).notification_func) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(notification_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_string_func) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(to_string_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_func) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(reference_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unreference_func) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(unreference_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create_instance_func) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(create_instance_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_instance_func) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(free_instance_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recreate_instance_func) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(recreate_instance_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_virtual_func) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(get_virtual_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_virtual_call_data_func) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(get_virtual_call_data_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).call_virtual_with_data_func) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(call_virtual_with_data_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_rid_func) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(get_rid_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).class_userdata) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo2),
            "::",
            stringify!(class_userdata)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextClassLibrary {
    _unused: [u8; 0],
}
pub type GDExtensionClassLibraryPtr = *mut __GdextClassLibrary;
pub const GDEXTENSION_METHOD_FLAG_NORMAL: GDExtensionClassMethodFlags = 1;
pub const GDEXTENSION_METHOD_FLAG_EDITOR: GDExtensionClassMethodFlags = 2;
pub const GDEXTENSION_METHOD_FLAG_CONST: GDExtensionClassMethodFlags = 4;
pub const GDEXTENSION_METHOD_FLAG_VIRTUAL: GDExtensionClassMethodFlags = 8;
pub const GDEXTENSION_METHOD_FLAG_VARARG: GDExtensionClassMethodFlags = 16;
pub const GDEXTENSION_METHOD_FLAG_STATIC: GDExtensionClassMethodFlags = 32;
pub const GDEXTENSION_METHOD_FLAGS_DEFAULT: GDExtensionClassMethodFlags = 1;
pub type GDExtensionClassMethodFlags = ::std::os::raw::c_uint;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_NONE: GDExtensionClassMethodArgumentMetadata = 0;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_INT8: GDExtensionClassMethodArgumentMetadata =
    1;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_INT16:
    GDExtensionClassMethodArgumentMetadata = 2;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_INT32:
    GDExtensionClassMethodArgumentMetadata = 3;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_INT64:
    GDExtensionClassMethodArgumentMetadata = 4;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_UINT8:
    GDExtensionClassMethodArgumentMetadata = 5;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_UINT16:
    GDExtensionClassMethodArgumentMetadata = 6;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_UINT32:
    GDExtensionClassMethodArgumentMetadata = 7;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_UINT64:
    GDExtensionClassMethodArgumentMetadata = 8;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_REAL_IS_FLOAT:
    GDExtensionClassMethodArgumentMetadata = 9;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_REAL_IS_DOUBLE:
    GDExtensionClassMethodArgumentMetadata = 10;
pub type GDExtensionClassMethodArgumentMetadata = ::std::os::raw::c_uint;
pub type GDExtensionClassMethodCall = ::std::option::Option<
    unsafe extern "C" fn(
        method_userdata: *mut ::std::os::raw::c_void,
        p_instance: GDExtensionClassInstancePtr,
        p_args: *const GDExtensionConstVariantPtr,
        p_argument_count: GDExtensionInt,
        r_return: GDExtensionVariantPtr,
        r_error: *mut GDExtensionCallError,
    ),
>;
pub type GDExtensionClassMethodValidatedCall = ::std::option::Option<
    unsafe extern "C" fn(
        method_userdata: *mut ::std::os::raw::c_void,
        p_instance: GDExtensionClassInstancePtr,
        p_args: *const GDExtensionConstVariantPtr,
        r_return: GDExtensionVariantPtr,
    ),
>;
pub type GDExtensionClassMethodPtrCall = ::std::option::Option<
    unsafe extern "C" fn(
        method_userdata: *mut ::std::os::raw::c_void,
        p_instance: GDExtensionClassInstancePtr,
        p_args: *const GDExtensionConstTypePtr,
        r_ret: GDExtensionTypePtr,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionClassMethodInfo {
    pub name: GDExtensionStringNamePtr,
    pub method_userdata: *mut ::std::os::raw::c_void,
    pub call_func: GDExtensionClassMethodCall,
    pub ptrcall_func: GDExtensionClassMethodPtrCall,
    pub method_flags: u32,
    pub has_return_value: GDExtensionBool,
    pub return_value_info: *mut GDExtensionPropertyInfo,
    pub return_value_metadata: GDExtensionClassMethodArgumentMetadata,
    pub argument_count: u32,
    pub arguments_info: *mut GDExtensionPropertyInfo,
    pub arguments_metadata: *mut GDExtensionClassMethodArgumentMetadata,
    pub default_argument_count: u32,
    pub default_arguments: *mut GDExtensionVariantPtr,
}
#[test]
fn bindgen_test_layout_GDExtensionClassMethodInfo() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionClassMethodInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionClassMethodInfo>(),
        88usize,
        concat!("Size of: ", stringify!(GDExtensionClassMethodInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionClassMethodInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionClassMethodInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method_userdata) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(method_userdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).call_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(call_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptrcall_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(ptrcall_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method_flags) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(method_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_return_value) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(has_return_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_value_info) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(return_value_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_value_metadata) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(return_value_metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argument_count) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(argument_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arguments_info) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(arguments_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arguments_metadata) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(arguments_metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_argument_count) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(default_argument_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_arguments) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(default_arguments)
        )
    );
}
pub type GDExtensionCallableCustomCall = ::std::option::Option<
    unsafe extern "C" fn(
        callable_userdata: *mut ::std::os::raw::c_void,
        p_args: *const GDExtensionConstVariantPtr,
        p_argument_count: GDExtensionInt,
        r_return: GDExtensionVariantPtr,
        r_error: *mut GDExtensionCallError,
    ),
>;
pub type GDExtensionCallableCustomIsValid = ::std::option::Option<
    unsafe extern "C" fn(callable_userdata: *mut ::std::os::raw::c_void) -> GDExtensionBool,
>;
pub type GDExtensionCallableCustomFree =
    ::std::option::Option<unsafe extern "C" fn(callable_userdata: *mut ::std::os::raw::c_void)>;
pub type GDExtensionCallableCustomHash = ::std::option::Option<
    unsafe extern "C" fn(callable_userdata: *mut ::std::os::raw::c_void) -> u32,
>;
pub type GDExtensionCallableCustomEqual = ::std::option::Option<
    unsafe extern "C" fn(
        callable_userdata_a: *mut ::std::os::raw::c_void,
        callable_userdata_b: *mut ::std::os::raw::c_void,
    ) -> GDExtensionBool,
>;
pub type GDExtensionCallableCustomLessThan = ::std::option::Option<
    unsafe extern "C" fn(
        callable_userdata_a: *mut ::std::os::raw::c_void,
        callable_userdata_b: *mut ::std::os::raw::c_void,
    ) -> GDExtensionBool,
>;
pub type GDExtensionCallableCustomToString = ::std::option::Option<
    unsafe extern "C" fn(
        callable_userdata: *mut ::std::os::raw::c_void,
        r_is_valid: *mut GDExtensionBool,
        r_out: GDExtensionStringPtr,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionCallableCustomInfo {
    pub callable_userdata: *mut ::std::os::raw::c_void,
    pub token: *mut ::std::os::raw::c_void,
    pub object_id: GDObjectInstanceID,
    pub call_func: GDExtensionCallableCustomCall,
    pub is_valid_func: GDExtensionCallableCustomIsValid,
    pub free_func: GDExtensionCallableCustomFree,
    pub hash_func: GDExtensionCallableCustomHash,
    pub equal_func: GDExtensionCallableCustomEqual,
    pub less_than_func: GDExtensionCallableCustomLessThan,
    pub to_string_func: GDExtensionCallableCustomToString,
}
#[test]
fn bindgen_test_layout_GDExtensionCallableCustomInfo() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionCallableCustomInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionCallableCustomInfo>(),
        80usize,
        concat!("Size of: ", stringify!(GDExtensionCallableCustomInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionCallableCustomInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionCallableCustomInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).callable_userdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallableCustomInfo),
            "::",
            stringify!(callable_userdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallableCustomInfo),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).object_id) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallableCustomInfo),
            "::",
            stringify!(object_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).call_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallableCustomInfo),
            "::",
            stringify!(call_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_valid_func) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallableCustomInfo),
            "::",
            stringify!(is_valid_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_func) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallableCustomInfo),
            "::",
            stringify!(free_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash_func) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallableCustomInfo),
            "::",
            stringify!(hash_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).equal_func) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallableCustomInfo),
            "::",
            stringify!(equal_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).less_than_func) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallableCustomInfo),
            "::",
            stringify!(less_than_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_string_func) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallableCustomInfo),
            "::",
            stringify!(to_string_func)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextScriptInstanceData {
    _unused: [u8; 0],
}
pub type GDExtensionScriptInstanceDataPtr = *mut __GdextScriptInstanceData;
pub type GDExtensionScriptInstanceSet = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_name: GDExtensionConstStringNamePtr,
        p_value: GDExtensionConstVariantPtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstanceGet = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_name: GDExtensionConstStringNamePtr,
        r_ret: GDExtensionVariantPtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstanceGetPropertyList = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        r_count: *mut u32,
    ) -> *const GDExtensionPropertyInfo,
>;
pub type GDExtensionScriptInstanceFreePropertyList = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_list: *const GDExtensionPropertyInfo,
    ),
>;
pub type GDExtensionScriptInstanceGetClassCategory = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_class_category: *mut GDExtensionPropertyInfo,
    ) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstanceGetPropertyType = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_name: GDExtensionConstStringNamePtr,
        r_is_valid: *mut GDExtensionBool,
    ) -> GDExtensionVariantType,
>;
pub type GDExtensionScriptInstanceValidateProperty = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_property: *mut GDExtensionPropertyInfo,
    ) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstancePropertyCanRevert = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_name: GDExtensionConstStringNamePtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstancePropertyGetRevert = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_name: GDExtensionConstStringNamePtr,
        r_ret: GDExtensionVariantPtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstanceGetOwner = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr) -> GDExtensionObjectPtr,
>;
pub type GDExtensionScriptInstancePropertyStateAdd = ::std::option::Option<
    unsafe extern "C" fn(
        p_name: GDExtensionConstStringNamePtr,
        p_value: GDExtensionConstVariantPtr,
        p_userdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type GDExtensionScriptInstanceGetPropertyState = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_add_func: GDExtensionScriptInstancePropertyStateAdd,
        p_userdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type GDExtensionScriptInstanceGetMethodList = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        r_count: *mut u32,
    ) -> *const GDExtensionMethodInfo,
>;
pub type GDExtensionScriptInstanceFreeMethodList = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_list: *const GDExtensionMethodInfo,
    ),
>;
pub type GDExtensionScriptInstanceHasMethod = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_name: GDExtensionConstStringNamePtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstanceCall = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionScriptInstanceDataPtr,
        p_method: GDExtensionConstStringNamePtr,
        p_args: *const GDExtensionConstVariantPtr,
        p_argument_count: GDExtensionInt,
        r_return: GDExtensionVariantPtr,
        r_error: *mut GDExtensionCallError,
    ),
>;
pub type GDExtensionScriptInstanceNotification = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr, p_what: i32),
>;
pub type GDExtensionScriptInstanceNotification2 = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_what: i32,
        p_reversed: GDExtensionBool,
    ),
>;
pub type GDExtensionScriptInstanceToString = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        r_is_valid: *mut GDExtensionBool,
        r_out: GDExtensionStringPtr,
    ),
>;
pub type GDExtensionScriptInstanceRefCountIncremented =
    ::std::option::Option<unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr)>;
pub type GDExtensionScriptInstanceRefCountDecremented = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstanceGetScript = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr) -> GDExtensionObjectPtr,
>;
pub type GDExtensionScriptInstanceIsPlaceholder = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr) -> GDExtensionBool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextScriptLanguage {
    _unused: [u8; 0],
}
pub type GDExtensionScriptLanguagePtr = *mut __GdextScriptLanguage;
pub type GDExtensionScriptInstanceGetLanguage = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
    ) -> GDExtensionScriptLanguagePtr,
>;
pub type GDExtensionScriptInstanceFree =
    ::std::option::Option<unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextScriptInstance {
    _unused: [u8; 0],
}
pub type GDExtensionScriptInstancePtr = *mut __GdextScriptInstance;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionScriptInstanceInfo {
    pub set_func: GDExtensionScriptInstanceSet,
    pub get_func: GDExtensionScriptInstanceGet,
    pub get_property_list_func: GDExtensionScriptInstanceGetPropertyList,
    pub free_property_list_func: GDExtensionScriptInstanceFreePropertyList,
    pub property_can_revert_func: GDExtensionScriptInstancePropertyCanRevert,
    pub property_get_revert_func: GDExtensionScriptInstancePropertyGetRevert,
    pub get_owner_func: GDExtensionScriptInstanceGetOwner,
    pub get_property_state_func: GDExtensionScriptInstanceGetPropertyState,
    pub get_method_list_func: GDExtensionScriptInstanceGetMethodList,
    pub free_method_list_func: GDExtensionScriptInstanceFreeMethodList,
    pub get_property_type_func: GDExtensionScriptInstanceGetPropertyType,
    pub has_method_func: GDExtensionScriptInstanceHasMethod,
    pub call_func: GDExtensionScriptInstanceCall,
    pub notification_func: GDExtensionScriptInstanceNotification,
    pub to_string_func: GDExtensionScriptInstanceToString,
    pub refcount_incremented_func: GDExtensionScriptInstanceRefCountIncremented,
    pub refcount_decremented_func: GDExtensionScriptInstanceRefCountDecremented,
    pub get_script_func: GDExtensionScriptInstanceGetScript,
    pub is_placeholder_func: GDExtensionScriptInstanceIsPlaceholder,
    pub set_fallback_func: GDExtensionScriptInstanceSet,
    pub get_fallback_func: GDExtensionScriptInstanceGet,
    pub get_language_func: GDExtensionScriptInstanceGetLanguage,
    pub free_func: GDExtensionScriptInstanceFree,
}
#[test]
fn bindgen_test_layout_GDExtensionScriptInstanceInfo() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionScriptInstanceInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionScriptInstanceInfo>(),
        184usize,
        concat!("Size of: ", stringify!(GDExtensionScriptInstanceInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionScriptInstanceInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionScriptInstanceInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(set_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_property_list_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_property_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_property_list_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(free_property_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_can_revert_func) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(property_can_revert_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_get_revert_func) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(property_get_revert_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_owner_func) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_owner_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_property_state_func) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_property_state_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_method_list_func) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_method_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_method_list_func) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(free_method_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_property_type_func) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_property_type_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_method_func) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(has_method_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).call_func) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(call_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).notification_func) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(notification_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_string_func) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(to_string_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refcount_incremented_func) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(refcount_incremented_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refcount_decremented_func) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(refcount_decremented_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_script_func) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_script_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_placeholder_func) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(is_placeholder_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_fallback_func) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(set_fallback_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_fallback_func) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_fallback_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_language_func) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_language_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_func) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(free_func)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionScriptInstanceInfo2 {
    pub set_func: GDExtensionScriptInstanceSet,
    pub get_func: GDExtensionScriptInstanceGet,
    pub get_property_list_func: GDExtensionScriptInstanceGetPropertyList,
    pub free_property_list_func: GDExtensionScriptInstanceFreePropertyList,
    pub get_class_category_func: GDExtensionScriptInstanceGetClassCategory,
    pub property_can_revert_func: GDExtensionScriptInstancePropertyCanRevert,
    pub property_get_revert_func: GDExtensionScriptInstancePropertyGetRevert,
    pub get_owner_func: GDExtensionScriptInstanceGetOwner,
    pub get_property_state_func: GDExtensionScriptInstanceGetPropertyState,
    pub get_method_list_func: GDExtensionScriptInstanceGetMethodList,
    pub free_method_list_func: GDExtensionScriptInstanceFreeMethodList,
    pub get_property_type_func: GDExtensionScriptInstanceGetPropertyType,
    pub validate_property_func: GDExtensionScriptInstanceValidateProperty,
    pub has_method_func: GDExtensionScriptInstanceHasMethod,
    pub call_func: GDExtensionScriptInstanceCall,
    pub notification_func: GDExtensionScriptInstanceNotification2,
    pub to_string_func: GDExtensionScriptInstanceToString,
    pub refcount_incremented_func: GDExtensionScriptInstanceRefCountIncremented,
    pub refcount_decremented_func: GDExtensionScriptInstanceRefCountDecremented,
    pub get_script_func: GDExtensionScriptInstanceGetScript,
    pub is_placeholder_func: GDExtensionScriptInstanceIsPlaceholder,
    pub set_fallback_func: GDExtensionScriptInstanceSet,
    pub get_fallback_func: GDExtensionScriptInstanceGet,
    pub get_language_func: GDExtensionScriptInstanceGetLanguage,
    pub free_func: GDExtensionScriptInstanceFree,
}
#[test]
fn bindgen_test_layout_GDExtensionScriptInstanceInfo2() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionScriptInstanceInfo2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionScriptInstanceInfo2>(),
        200usize,
        concat!("Size of: ", stringify!(GDExtensionScriptInstanceInfo2))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionScriptInstanceInfo2>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionScriptInstanceInfo2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(set_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(get_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_property_list_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(get_property_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_property_list_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(free_property_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_class_category_func) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(get_class_category_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_can_revert_func) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(property_can_revert_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_get_revert_func) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(property_get_revert_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_owner_func) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(get_owner_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_property_state_func) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(get_property_state_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_method_list_func) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(get_method_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_method_list_func) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(free_method_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_property_type_func) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(get_property_type_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).validate_property_func) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(validate_property_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_method_func) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(has_method_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).call_func) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(call_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).notification_func) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(notification_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_string_func) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(to_string_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refcount_incremented_func) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(refcount_incremented_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refcount_decremented_func) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(refcount_decremented_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_script_func) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(get_script_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_placeholder_func) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(is_placeholder_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_fallback_func) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(set_fallback_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_fallback_func) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(get_fallback_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_language_func) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(get_language_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_func) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo2),
            "::",
            stringify!(free_func)
        )
    );
}
pub const GDEXTENSION_INITIALIZATION_CORE: GDExtensionInitializationLevel = 0;
pub const GDEXTENSION_INITIALIZATION_SERVERS: GDExtensionInitializationLevel = 1;
pub const GDEXTENSION_INITIALIZATION_SCENE: GDExtensionInitializationLevel = 2;
pub const GDEXTENSION_INITIALIZATION_EDITOR: GDExtensionInitializationLevel = 3;
pub const GDEXTENSION_MAX_INITIALIZATION_LEVEL: GDExtensionInitializationLevel = 4;
pub type GDExtensionInitializationLevel = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionInitialization {
    pub minimum_initialization_level: GDExtensionInitializationLevel,
    pub userdata: *mut ::std::os::raw::c_void,
    pub initialize: ::std::option::Option<
        unsafe extern "C" fn(
            userdata: *mut ::std::os::raw::c_void,
            p_level: GDExtensionInitializationLevel,
        ),
    >,
    pub deinitialize: ::std::option::Option<
        unsafe extern "C" fn(
            userdata: *mut ::std::os::raw::c_void,
            p_level: GDExtensionInitializationLevel,
        ),
    >,
}
#[test]
fn bindgen_test_layout_GDExtensionInitialization() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionInitialization> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionInitialization>(),
        32usize,
        concat!("Size of: ", stringify!(GDExtensionInitialization))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionInitialization>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionInitialization))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).minimum_initialization_level) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInitialization),
            "::",
            stringify!(minimum_initialization_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).userdata) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInitialization),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInitialization),
            "::",
            stringify!(initialize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deinitialize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInitialization),
            "::",
            stringify!(deinitialize)
        )
    );
}
pub type GDExtensionInterfaceFunctionPtr = ::std::option::Option<unsafe extern "C" fn()>;
pub type GDExtensionInterfaceGetProcAddress = ::std::option::Option<
    unsafe extern "C" fn(
        p_function_name: *const ::std::os::raw::c_char,
    ) -> GDExtensionInterfaceFunctionPtr,
>;
pub type GDExtensionInitializationFunction = ::std::option::Option<
    unsafe extern "C" fn(
        p_get_proc_address: GDExtensionInterfaceGetProcAddress,
        p_library: GDExtensionClassLibraryPtr,
        r_initialization: *mut GDExtensionInitialization,
    ) -> GDExtensionBool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionGodotVersion {
    pub major: u32,
    pub minor: u32,
    pub patch: u32,
    pub string: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_GDExtensionGodotVersion() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionGodotVersion> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionGodotVersion>(),
        24usize,
        concat!("Size of: ", stringify!(GDExtensionGodotVersion))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionGodotVersion>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionGodotVersion))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).major) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionGodotVersion),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minor) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionGodotVersion),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).patch) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionGodotVersion),
            "::",
            stringify!(patch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionGodotVersion),
            "::",
            stringify!(string)
        )
    );
}
#[doc = " @name get_godot_version\n @since 4.1\n\n Gets the Godot version that the GDExtension was loaded into.\n\n @param r_godot_version A pointer to the structure to write the version information into."]
pub type GDExtensionInterfaceGetGodotVersion =
    ::std::option::Option<unsafe extern "C" fn(r_godot_version: *mut GDExtensionGodotVersion)>;
#[doc = " @name mem_alloc\n @since 4.1\n\n Allocates memory.\n\n @param p_bytes The amount of memory to allocate in bytes.\n\n @return A pointer to the allocated memory, or NULL if unsuccessful."]
pub type GDExtensionInterfaceMemAlloc =
    ::std::option::Option<unsafe extern "C" fn(p_bytes: usize) -> *mut ::std::os::raw::c_void>;
