/* automatically generated by rust-bindgen 0.68.1 */

pub const __DARWIN_ONLY_64_BIT_INO_T: u32 = 0;
pub const __DARWIN_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const __DARWIN_ONLY_VERS_1050: u32 = 0;
pub const __DARWIN_UNIX03: u32 = 1;
pub const __DARWIN_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_VERS_1050: u32 = 1;
pub const __DARWIN_NON_CANCELABLE: u32 = 0;
pub const __DARWIN_SUF_64_BIT_INO_T: &[u8; 9] = b"$INODE64\0";
pub const __DARWIN_SUF_1050: &[u8; 6] = b"$1050\0";
pub const __DARWIN_SUF_EXTSN: &[u8; 14] = b"$DARWIN_EXTSN\0";
pub const __DARWIN_C_ANSI: u32 = 4096;
pub const __DARWIN_C_FULL: u32 = 900000;
pub const __DARWIN_C_LEVEL: u32 = 900000;
pub const __STDC_WANT_LIB_EXT1__: u32 = 1;
pub const __DARWIN_NO_LONG_LONG: u32 = 0;
pub const _DARWIN_FEATURE_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const _DARWIN_FEATURE_UNIX_CONFORMANCE: u32 = 3;
pub const __has_ptrcheck: u32 = 0;
pub const __PTHREAD_SIZE__: u32 = 8176;
pub const __PTHREAD_ATTR_SIZE__: u32 = 56;
pub const __PTHREAD_MUTEXATTR_SIZE__: u32 = 8;
pub const __PTHREAD_MUTEX_SIZE__: u32 = 56;
pub const __PTHREAD_CONDATTR_SIZE__: u32 = 8;
pub const __PTHREAD_COND_SIZE__: u32 = 40;
pub const __PTHREAD_ONCE_SIZE__: u32 = 8;
pub const __PTHREAD_RWLOCK_SIZE__: u32 = 192;
pub const __PTHREAD_RWLOCKATTR_SIZE__: u32 = 16;
pub const __DARWIN_WCHAR_MIN: i32 = -2147483648;
pub const _FORTIFY_SOURCE: u32 = 2;
pub const __WORDSIZE: u32 = 64;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const INT64_MAX: u64 = 9223372036854775807;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT64_MIN: i64 = -9223372036854775808;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const UINT64_MAX: i32 = -1;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST64_MIN: i64 = -9223372036854775808;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const INT_LEAST64_MAX: u64 = 9223372036854775807;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const UINT_LEAST64_MAX: i32 = -1;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i32 = -32768;
pub const INT_FAST32_MIN: i32 = -2147483648;
pub const INT_FAST64_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u32 = 32767;
pub const INT_FAST32_MAX: u32 = 2147483647;
pub const INT_FAST64_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: u32 = 65535;
pub const UINT_FAST32_MAX: u32 = 4294967295;
pub const UINT_FAST64_MAX: i32 = -1;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const UINTPTR_MAX: i32 = -1;
pub const SIZE_MAX: i32 = -1;
pub const RSIZE_MAX: i32 = -1;
pub const WINT_MIN: i32 = -2147483648;
pub const WINT_MAX: u32 = 2147483647;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__mbstate8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mbstateL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    const UNINIT: ::std::mem::MaybeUninit<__darwin_pthread_handler_rec> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::std::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__routine) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__arg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_attr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_cond_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_condattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutex_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutexattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutexattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutexattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_once_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_once_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_once_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlock_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlock_t>(),
        200usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlockattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
        24usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cleanup_stack) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__cleanup_stack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__opaque)
        )
    );
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type rsize_t = __darwin_size_t;
pub type wchar_t = __darwin_wchar_t;
pub type wint_t = __darwin_wint_t;
pub type max_align_t = u128;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type char32_t = u32;
pub type char16_t = u16;
pub const GDEXTENSION_VARIANT_TYPE_NIL: GDExtensionVariantType = 0;
pub const GDEXTENSION_VARIANT_TYPE_BOOL: GDExtensionVariantType = 1;
pub const GDEXTENSION_VARIANT_TYPE_INT: GDExtensionVariantType = 2;
pub const GDEXTENSION_VARIANT_TYPE_FLOAT: GDExtensionVariantType = 3;
pub const GDEXTENSION_VARIANT_TYPE_STRING: GDExtensionVariantType = 4;
pub const GDEXTENSION_VARIANT_TYPE_VECTOR2: GDExtensionVariantType = 5;
pub const GDEXTENSION_VARIANT_TYPE_VECTOR2I: GDExtensionVariantType = 6;
pub const GDEXTENSION_VARIANT_TYPE_RECT2: GDExtensionVariantType = 7;
pub const GDEXTENSION_VARIANT_TYPE_RECT2I: GDExtensionVariantType = 8;
pub const GDEXTENSION_VARIANT_TYPE_VECTOR3: GDExtensionVariantType = 9;
pub const GDEXTENSION_VARIANT_TYPE_VECTOR3I: GDExtensionVariantType = 10;
pub const GDEXTENSION_VARIANT_TYPE_TRANSFORM2D: GDExtensionVariantType = 11;
pub const GDEXTENSION_VARIANT_TYPE_VECTOR4: GDExtensionVariantType = 12;
pub const GDEXTENSION_VARIANT_TYPE_VECTOR4I: GDExtensionVariantType = 13;
pub const GDEXTENSION_VARIANT_TYPE_PLANE: GDExtensionVariantType = 14;
pub const GDEXTENSION_VARIANT_TYPE_QUATERNION: GDExtensionVariantType = 15;
pub const GDEXTENSION_VARIANT_TYPE_AABB: GDExtensionVariantType = 16;
pub const GDEXTENSION_VARIANT_TYPE_BASIS: GDExtensionVariantType = 17;
pub const GDEXTENSION_VARIANT_TYPE_TRANSFORM3D: GDExtensionVariantType = 18;
pub const GDEXTENSION_VARIANT_TYPE_PROJECTION: GDExtensionVariantType = 19;
pub const GDEXTENSION_VARIANT_TYPE_COLOR: GDExtensionVariantType = 20;
pub const GDEXTENSION_VARIANT_TYPE_STRING_NAME: GDExtensionVariantType = 21;
pub const GDEXTENSION_VARIANT_TYPE_NODE_PATH: GDExtensionVariantType = 22;
pub const GDEXTENSION_VARIANT_TYPE_RID: GDExtensionVariantType = 23;
pub const GDEXTENSION_VARIANT_TYPE_OBJECT: GDExtensionVariantType = 24;
pub const GDEXTENSION_VARIANT_TYPE_CALLABLE: GDExtensionVariantType = 25;
pub const GDEXTENSION_VARIANT_TYPE_SIGNAL: GDExtensionVariantType = 26;
pub const GDEXTENSION_VARIANT_TYPE_DICTIONARY: GDExtensionVariantType = 27;
pub const GDEXTENSION_VARIANT_TYPE_ARRAY: GDExtensionVariantType = 28;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_BYTE_ARRAY: GDExtensionVariantType = 29;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_INT32_ARRAY: GDExtensionVariantType = 30;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_INT64_ARRAY: GDExtensionVariantType = 31;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_FLOAT32_ARRAY: GDExtensionVariantType = 32;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_FLOAT64_ARRAY: GDExtensionVariantType = 33;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_STRING_ARRAY: GDExtensionVariantType = 34;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_VECTOR2_ARRAY: GDExtensionVariantType = 35;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_VECTOR3_ARRAY: GDExtensionVariantType = 36;
pub const GDEXTENSION_VARIANT_TYPE_PACKED_COLOR_ARRAY: GDExtensionVariantType = 37;
pub const GDEXTENSION_VARIANT_TYPE_VARIANT_MAX: GDExtensionVariantType = 38;
pub type GDExtensionVariantType = ::std::os::raw::c_uint;
pub const GDEXTENSION_VARIANT_OP_EQUAL: GDExtensionVariantOperator = 0;
pub const GDEXTENSION_VARIANT_OP_NOT_EQUAL: GDExtensionVariantOperator = 1;
pub const GDEXTENSION_VARIANT_OP_LESS: GDExtensionVariantOperator = 2;
pub const GDEXTENSION_VARIANT_OP_LESS_EQUAL: GDExtensionVariantOperator = 3;
pub const GDEXTENSION_VARIANT_OP_GREATER: GDExtensionVariantOperator = 4;
pub const GDEXTENSION_VARIANT_OP_GREATER_EQUAL: GDExtensionVariantOperator = 5;
pub const GDEXTENSION_VARIANT_OP_ADD: GDExtensionVariantOperator = 6;
pub const GDEXTENSION_VARIANT_OP_SUBTRACT: GDExtensionVariantOperator = 7;
pub const GDEXTENSION_VARIANT_OP_MULTIPLY: GDExtensionVariantOperator = 8;
pub const GDEXTENSION_VARIANT_OP_DIVIDE: GDExtensionVariantOperator = 9;
pub const GDEXTENSION_VARIANT_OP_NEGATE: GDExtensionVariantOperator = 10;
pub const GDEXTENSION_VARIANT_OP_POSITIVE: GDExtensionVariantOperator = 11;
pub const GDEXTENSION_VARIANT_OP_MODULE: GDExtensionVariantOperator = 12;
pub const GDEXTENSION_VARIANT_OP_POWER: GDExtensionVariantOperator = 13;
pub const GDEXTENSION_VARIANT_OP_SHIFT_LEFT: GDExtensionVariantOperator = 14;
pub const GDEXTENSION_VARIANT_OP_SHIFT_RIGHT: GDExtensionVariantOperator = 15;
pub const GDEXTENSION_VARIANT_OP_BIT_AND: GDExtensionVariantOperator = 16;
pub const GDEXTENSION_VARIANT_OP_BIT_OR: GDExtensionVariantOperator = 17;
pub const GDEXTENSION_VARIANT_OP_BIT_XOR: GDExtensionVariantOperator = 18;
pub const GDEXTENSION_VARIANT_OP_BIT_NEGATE: GDExtensionVariantOperator = 19;
pub const GDEXTENSION_VARIANT_OP_AND: GDExtensionVariantOperator = 20;
pub const GDEXTENSION_VARIANT_OP_OR: GDExtensionVariantOperator = 21;
pub const GDEXTENSION_VARIANT_OP_XOR: GDExtensionVariantOperator = 22;
pub const GDEXTENSION_VARIANT_OP_NOT: GDExtensionVariantOperator = 23;
pub const GDEXTENSION_VARIANT_OP_IN: GDExtensionVariantOperator = 24;
pub const GDEXTENSION_VARIANT_OP_MAX: GDExtensionVariantOperator = 25;
pub type GDExtensionVariantOperator = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextVariant {
    _unused: [u8; 0],
}
pub type GDExtensionVariantPtr = *mut __GdextVariant;
pub type GDExtensionConstVariantPtr = *const __GdextVariant;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextUninitializedVariant {
    _unused: [u8; 0],
}
pub type GDExtensionUninitializedVariantPtr = *mut __GdextUninitializedVariant;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextStringName {
    _unused: [u8; 0],
}
pub type GDExtensionStringNamePtr = *mut __GdextStringName;
pub type GDExtensionConstStringNamePtr = *const __GdextStringName;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextUninitializedStringName {
    _unused: [u8; 0],
}
pub type GDExtensionUninitializedStringNamePtr = *mut __GdextUninitializedStringName;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextString {
    _unused: [u8; 0],
}
pub type GDExtensionStringPtr = *mut __GdextString;
pub type GDExtensionConstStringPtr = *const __GdextString;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextUninitializedString {
    _unused: [u8; 0],
}
pub type GDExtensionUninitializedStringPtr = *mut __GdextUninitializedString;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextObject {
    _unused: [u8; 0],
}
pub type GDExtensionObjectPtr = *mut __GdextObject;
pub type GDExtensionConstObjectPtr = *const __GdextObject;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextUninitializedObject {
    _unused: [u8; 0],
}
pub type GDExtensionUninitializedObjectPtr = *mut __GdextUninitializedObject;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextType {
    _unused: [u8; 0],
}
pub type GDExtensionTypePtr = *mut __GdextType;
pub type GDExtensionConstTypePtr = *const __GdextType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextUninitializedType {
    _unused: [u8; 0],
}
pub type GDExtensionUninitializedTypePtr = *mut __GdextUninitializedType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextMethodBind {
    _unused: [u8; 0],
}
pub type GDExtensionMethodBindPtr = *const __GdextMethodBind;
pub type GDExtensionInt = i64;
pub type GDExtensionBool = u8;
pub type GDObjectInstanceID = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextRef {
    _unused: [u8; 0],
}
pub type GDExtensionRefPtr = *mut __GdextRef;
pub type GDExtensionConstRefPtr = *const __GdextRef;
pub const GDEXTENSION_CALL_OK: GDExtensionCallErrorType = 0;
pub const GDEXTENSION_CALL_ERROR_INVALID_METHOD: GDExtensionCallErrorType = 1;
pub const GDEXTENSION_CALL_ERROR_INVALID_ARGUMENT: GDExtensionCallErrorType = 2;
pub const GDEXTENSION_CALL_ERROR_TOO_MANY_ARGUMENTS: GDExtensionCallErrorType = 3;
pub const GDEXTENSION_CALL_ERROR_TOO_FEW_ARGUMENTS: GDExtensionCallErrorType = 4;
pub const GDEXTENSION_CALL_ERROR_INSTANCE_IS_NULL: GDExtensionCallErrorType = 5;
pub const GDEXTENSION_CALL_ERROR_METHOD_NOT_CONST: GDExtensionCallErrorType = 6;
pub type GDExtensionCallErrorType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionCallError {
    pub error: GDExtensionCallErrorType,
    pub argument: i32,
    pub expected: i32,
}
#[test]
fn bindgen_test_layout_GDExtensionCallError() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionCallError> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionCallError>(),
        12usize,
        concat!("Size of: ", stringify!(GDExtensionCallError))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionCallError>(),
        4usize,
        concat!("Alignment of ", stringify!(GDExtensionCallError))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallError),
            "::",
            stringify!(error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argument) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallError),
            "::",
            stringify!(argument)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).expected) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionCallError),
            "::",
            stringify!(expected)
        )
    );
}
pub type GDExtensionVariantFromTypeConstructorFunc = ::std::option::Option<
    unsafe extern "C" fn(arg1: GDExtensionUninitializedVariantPtr, arg2: GDExtensionTypePtr),
>;
pub type GDExtensionTypeFromVariantConstructorFunc = ::std::option::Option<
    unsafe extern "C" fn(arg1: GDExtensionUninitializedTypePtr, arg2: GDExtensionVariantPtr),
>;
pub type GDExtensionPtrOperatorEvaluator = ::std::option::Option<
    unsafe extern "C" fn(
        p_left: GDExtensionConstTypePtr,
        p_right: GDExtensionConstTypePtr,
        r_result: GDExtensionTypePtr,
    ),
>;
pub type GDExtensionPtrBuiltInMethod = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionTypePtr,
        p_args: *const GDExtensionConstTypePtr,
        r_return: GDExtensionTypePtr,
        p_argument_count: ::std::os::raw::c_int,
    ),
>;
pub type GDExtensionPtrConstructor = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionUninitializedTypePtr,
        p_args: *const GDExtensionConstTypePtr,
    ),
>;
pub type GDExtensionPtrDestructor =
    ::std::option::Option<unsafe extern "C" fn(p_base: GDExtensionTypePtr)>;
pub type GDExtensionPtrSetter = ::std::option::Option<
    unsafe extern "C" fn(p_base: GDExtensionTypePtr, p_value: GDExtensionConstTypePtr),
>;
pub type GDExtensionPtrGetter = ::std::option::Option<
    unsafe extern "C" fn(p_base: GDExtensionConstTypePtr, r_value: GDExtensionTypePtr),
>;
pub type GDExtensionPtrIndexedSetter = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionTypePtr,
        p_index: GDExtensionInt,
        p_value: GDExtensionConstTypePtr,
    ),
>;
pub type GDExtensionPtrIndexedGetter = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionConstTypePtr,
        p_index: GDExtensionInt,
        r_value: GDExtensionTypePtr,
    ),
>;
pub type GDExtensionPtrKeyedSetter = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionTypePtr,
        p_key: GDExtensionConstTypePtr,
        p_value: GDExtensionConstTypePtr,
    ),
>;
pub type GDExtensionPtrKeyedGetter = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionConstTypePtr,
        p_key: GDExtensionConstTypePtr,
        r_value: GDExtensionTypePtr,
    ),
>;
pub type GDExtensionPtrKeyedChecker = ::std::option::Option<
    unsafe extern "C" fn(
        p_base: GDExtensionConstVariantPtr,
        p_key: GDExtensionConstVariantPtr,
    ) -> u32,
>;
pub type GDExtensionPtrUtilityFunction = ::std::option::Option<
    unsafe extern "C" fn(
        r_return: GDExtensionTypePtr,
        p_args: *const GDExtensionConstTypePtr,
        p_argument_count: ::std::os::raw::c_int,
    ),
>;
pub type GDExtensionClassConstructor =
    ::std::option::Option<unsafe extern "C" fn() -> GDExtensionObjectPtr>;
pub type GDExtensionInstanceBindingCreateCallback = ::std::option::Option<
    unsafe extern "C" fn(
        p_token: *mut ::std::os::raw::c_void,
        p_instance: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type GDExtensionInstanceBindingFreeCallback = ::std::option::Option<
    unsafe extern "C" fn(
        p_token: *mut ::std::os::raw::c_void,
        p_instance: *mut ::std::os::raw::c_void,
        p_binding: *mut ::std::os::raw::c_void,
    ),
>;
pub type GDExtensionInstanceBindingReferenceCallback = ::std::option::Option<
    unsafe extern "C" fn(
        p_token: *mut ::std::os::raw::c_void,
        p_binding: *mut ::std::os::raw::c_void,
        p_reference: GDExtensionBool,
    ) -> GDExtensionBool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionInstanceBindingCallbacks {
    pub create_callback: GDExtensionInstanceBindingCreateCallback,
    pub free_callback: GDExtensionInstanceBindingFreeCallback,
    pub reference_callback: GDExtensionInstanceBindingReferenceCallback,
}
#[test]
fn bindgen_test_layout_GDExtensionInstanceBindingCallbacks() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionInstanceBindingCallbacks> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionInstanceBindingCallbacks>(),
        24usize,
        concat!("Size of: ", stringify!(GDExtensionInstanceBindingCallbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionInstanceBindingCallbacks>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(GDExtensionInstanceBindingCallbacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create_callback) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInstanceBindingCallbacks),
            "::",
            stringify!(create_callback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_callback) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInstanceBindingCallbacks),
            "::",
            stringify!(free_callback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_callback) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInstanceBindingCallbacks),
            "::",
            stringify!(reference_callback)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextClassInstance {
    _unused: [u8; 0],
}
pub type GDExtensionClassInstancePtr = *mut __GdextClassInstance;
pub type GDExtensionClassSet = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_name: GDExtensionConstStringNamePtr,
        p_value: GDExtensionConstVariantPtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionClassGet = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_name: GDExtensionConstStringNamePtr,
        r_ret: GDExtensionVariantPtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionClassGetRID =
    ::std::option::Option<unsafe extern "C" fn(p_instance: GDExtensionClassInstancePtr) -> u64>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionPropertyInfo {
    pub type_: GDExtensionVariantType,
    pub name: GDExtensionStringNamePtr,
    pub class_name: GDExtensionStringNamePtr,
    pub hint: u32,
    pub hint_string: GDExtensionStringPtr,
    pub usage: u32,
}
#[test]
fn bindgen_test_layout_GDExtensionPropertyInfo() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionPropertyInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionPropertyInfo>(),
        48usize,
        concat!("Size of: ", stringify!(GDExtensionPropertyInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionPropertyInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionPropertyInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionPropertyInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionPropertyInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).class_name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionPropertyInfo),
            "::",
            stringify!(class_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hint) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionPropertyInfo),
            "::",
            stringify!(hint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hint_string) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionPropertyInfo),
            "::",
            stringify!(hint_string)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).usage) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionPropertyInfo),
            "::",
            stringify!(usage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionMethodInfo {
    pub name: GDExtensionStringNamePtr,
    pub return_value: GDExtensionPropertyInfo,
    pub flags: u32,
    pub id: i32,
    pub argument_count: u32,
    pub arguments: *mut GDExtensionPropertyInfo,
    pub default_argument_count: u32,
    pub default_arguments: *mut GDExtensionVariantPtr,
}
#[test]
fn bindgen_test_layout_GDExtensionMethodInfo() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionMethodInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionMethodInfo>(),
        96usize,
        concat!("Size of: ", stringify!(GDExtensionMethodInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionMethodInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionMethodInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(return_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argument_count) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(argument_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arguments) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(arguments)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_argument_count) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(default_argument_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_arguments) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionMethodInfo),
            "::",
            stringify!(default_arguments)
        )
    );
}
pub type GDExtensionClassGetPropertyList = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        r_count: *mut u32,
    ) -> *const GDExtensionPropertyInfo,
>;
pub type GDExtensionClassFreePropertyList = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_list: *const GDExtensionPropertyInfo,
    ),
>;
pub type GDExtensionClassPropertyCanRevert = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_name: GDExtensionConstStringNamePtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionClassPropertyGetRevert = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_name: GDExtensionConstStringNamePtr,
        r_ret: GDExtensionVariantPtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionClassNotification = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionClassInstancePtr, p_what: i32),
>;
pub type GDExtensionClassToString = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        r_is_valid: *mut GDExtensionBool,
        p_out: GDExtensionStringPtr,
    ),
>;
pub type GDExtensionClassReference =
    ::std::option::Option<unsafe extern "C" fn(p_instance: GDExtensionClassInstancePtr)>;
pub type GDExtensionClassUnreference =
    ::std::option::Option<unsafe extern "C" fn(p_instance: GDExtensionClassInstancePtr)>;
pub type GDExtensionClassCallVirtual = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionClassInstancePtr,
        p_args: *const GDExtensionConstTypePtr,
        r_ret: GDExtensionTypePtr,
    ),
>;
pub type GDExtensionClassCreateInstance = ::std::option::Option<
    unsafe extern "C" fn(p_userdata: *mut ::std::os::raw::c_void) -> GDExtensionObjectPtr,
>;
pub type GDExtensionClassFreeInstance = ::std::option::Option<
    unsafe extern "C" fn(
        p_userdata: *mut ::std::os::raw::c_void,
        p_instance: GDExtensionClassInstancePtr,
    ),
>;
pub type GDExtensionClassGetVirtual = ::std::option::Option<
    unsafe extern "C" fn(
        p_userdata: *mut ::std::os::raw::c_void,
        p_name: GDExtensionConstStringNamePtr,
    ) -> GDExtensionClassCallVirtual,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionClassCreationInfo {
    pub is_virtual: GDExtensionBool,
    pub is_abstract: GDExtensionBool,
    pub set_func: GDExtensionClassSet,
    pub get_func: GDExtensionClassGet,
    pub get_property_list_func: GDExtensionClassGetPropertyList,
    pub free_property_list_func: GDExtensionClassFreePropertyList,
    pub property_can_revert_func: GDExtensionClassPropertyCanRevert,
    pub property_get_revert_func: GDExtensionClassPropertyGetRevert,
    pub notification_func: GDExtensionClassNotification,
    pub to_string_func: GDExtensionClassToString,
    pub reference_func: GDExtensionClassReference,
    pub unreference_func: GDExtensionClassUnreference,
    pub create_instance_func: GDExtensionClassCreateInstance,
    pub free_instance_func: GDExtensionClassFreeInstance,
    pub get_virtual_func: GDExtensionClassGetVirtual,
    pub get_rid_func: GDExtensionClassGetRID,
    pub class_userdata: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_GDExtensionClassCreationInfo() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionClassCreationInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionClassCreationInfo>(),
        128usize,
        concat!("Size of: ", stringify!(GDExtensionClassCreationInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionClassCreationInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionClassCreationInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_virtual) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(is_virtual)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_abstract) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(is_abstract)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(set_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(get_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_property_list_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(get_property_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_property_list_func) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(free_property_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_can_revert_func) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(property_can_revert_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_get_revert_func) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(property_get_revert_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).notification_func) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(notification_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_string_func) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(to_string_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_func) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(reference_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unreference_func) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(unreference_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create_instance_func) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(create_instance_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_instance_func) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(free_instance_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_virtual_func) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(get_virtual_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_rid_func) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(get_rid_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).class_userdata) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassCreationInfo),
            "::",
            stringify!(class_userdata)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextClassLibrary {
    _unused: [u8; 0],
}
pub type GDExtensionClassLibraryPtr = *mut __GdextClassLibrary;
pub const GDEXTENSION_METHOD_FLAG_NORMAL: GDExtensionClassMethodFlags = 1;
pub const GDEXTENSION_METHOD_FLAG_EDITOR: GDExtensionClassMethodFlags = 2;
pub const GDEXTENSION_METHOD_FLAG_CONST: GDExtensionClassMethodFlags = 4;
pub const GDEXTENSION_METHOD_FLAG_VIRTUAL: GDExtensionClassMethodFlags = 8;
pub const GDEXTENSION_METHOD_FLAG_VARARG: GDExtensionClassMethodFlags = 16;
pub const GDEXTENSION_METHOD_FLAG_STATIC: GDExtensionClassMethodFlags = 32;
pub const GDEXTENSION_METHOD_FLAGS_DEFAULT: GDExtensionClassMethodFlags = 1;
pub type GDExtensionClassMethodFlags = ::std::os::raw::c_uint;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_NONE: GDExtensionClassMethodArgumentMetadata = 0;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_INT8: GDExtensionClassMethodArgumentMetadata =
    1;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_INT16:
    GDExtensionClassMethodArgumentMetadata = 2;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_INT32:
    GDExtensionClassMethodArgumentMetadata = 3;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_INT64:
    GDExtensionClassMethodArgumentMetadata = 4;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_UINT8:
    GDExtensionClassMethodArgumentMetadata = 5;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_UINT16:
    GDExtensionClassMethodArgumentMetadata = 6;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_UINT32:
    GDExtensionClassMethodArgumentMetadata = 7;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_INT_IS_UINT64:
    GDExtensionClassMethodArgumentMetadata = 8;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_REAL_IS_FLOAT:
    GDExtensionClassMethodArgumentMetadata = 9;
pub const GDEXTENSION_METHOD_ARGUMENT_METADATA_REAL_IS_DOUBLE:
    GDExtensionClassMethodArgumentMetadata = 10;
pub type GDExtensionClassMethodArgumentMetadata = ::std::os::raw::c_uint;
pub type GDExtensionClassMethodCall = ::std::option::Option<
    unsafe extern "C" fn(
        method_userdata: *mut ::std::os::raw::c_void,
        p_instance: GDExtensionClassInstancePtr,
        p_args: *const GDExtensionConstVariantPtr,
        p_argument_count: GDExtensionInt,
        r_return: GDExtensionVariantPtr,
        r_error: *mut GDExtensionCallError,
    ),
>;
pub type GDExtensionClassMethodValidatedCall = ::std::option::Option<
    unsafe extern "C" fn(
        method_userdata: *mut ::std::os::raw::c_void,
        p_instance: GDExtensionClassInstancePtr,
        p_args: *const GDExtensionConstVariantPtr,
        r_return: GDExtensionVariantPtr,
    ),
>;
pub type GDExtensionClassMethodPtrCall = ::std::option::Option<
    unsafe extern "C" fn(
        method_userdata: *mut ::std::os::raw::c_void,
        p_instance: GDExtensionClassInstancePtr,
        p_args: *const GDExtensionConstTypePtr,
        r_ret: GDExtensionTypePtr,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionClassMethodInfo {
    pub name: GDExtensionStringNamePtr,
    pub method_userdata: *mut ::std::os::raw::c_void,
    pub call_func: GDExtensionClassMethodCall,
    pub ptrcall_func: GDExtensionClassMethodPtrCall,
    pub method_flags: u32,
    pub has_return_value: GDExtensionBool,
    pub return_value_info: *mut GDExtensionPropertyInfo,
    pub return_value_metadata: GDExtensionClassMethodArgumentMetadata,
    pub argument_count: u32,
    pub arguments_info: *mut GDExtensionPropertyInfo,
    pub arguments_metadata: *mut GDExtensionClassMethodArgumentMetadata,
    pub default_argument_count: u32,
    pub default_arguments: *mut GDExtensionVariantPtr,
}
#[test]
fn bindgen_test_layout_GDExtensionClassMethodInfo() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionClassMethodInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionClassMethodInfo>(),
        88usize,
        concat!("Size of: ", stringify!(GDExtensionClassMethodInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionClassMethodInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionClassMethodInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method_userdata) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(method_userdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).call_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(call_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptrcall_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(ptrcall_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method_flags) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(method_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_return_value) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(has_return_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_value_info) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(return_value_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_value_metadata) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(return_value_metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argument_count) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(argument_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arguments_info) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(arguments_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arguments_metadata) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(arguments_metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_argument_count) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(default_argument_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_arguments) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionClassMethodInfo),
            "::",
            stringify!(default_arguments)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextScriptInstanceData {
    _unused: [u8; 0],
}
pub type GDExtensionScriptInstanceDataPtr = *mut __GdextScriptInstanceData;
pub type GDExtensionScriptInstanceSet = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_name: GDExtensionConstStringNamePtr,
        p_value: GDExtensionConstVariantPtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstanceGet = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_name: GDExtensionConstStringNamePtr,
        r_ret: GDExtensionVariantPtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstanceGetPropertyList = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        r_count: *mut u32,
    ) -> *const GDExtensionPropertyInfo,
>;
pub type GDExtensionScriptInstanceFreePropertyList = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_list: *const GDExtensionPropertyInfo,
    ),
>;
pub type GDExtensionScriptInstanceGetPropertyType = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_name: GDExtensionConstStringNamePtr,
        r_is_valid: *mut GDExtensionBool,
    ) -> GDExtensionVariantType,
>;
pub type GDExtensionScriptInstancePropertyCanRevert = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_name: GDExtensionConstStringNamePtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstancePropertyGetRevert = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_name: GDExtensionConstStringNamePtr,
        r_ret: GDExtensionVariantPtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstanceGetOwner = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr) -> GDExtensionObjectPtr,
>;
pub type GDExtensionScriptInstancePropertyStateAdd = ::std::option::Option<
    unsafe extern "C" fn(
        p_name: GDExtensionConstStringNamePtr,
        p_value: GDExtensionConstVariantPtr,
        p_userdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type GDExtensionScriptInstanceGetPropertyState = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_add_func: GDExtensionScriptInstancePropertyStateAdd,
        p_userdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type GDExtensionScriptInstanceGetMethodList = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        r_count: *mut u32,
    ) -> *const GDExtensionMethodInfo,
>;
pub type GDExtensionScriptInstanceFreeMethodList = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_list: *const GDExtensionMethodInfo,
    ),
>;
pub type GDExtensionScriptInstanceHasMethod = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        p_name: GDExtensionConstStringNamePtr,
    ) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstanceCall = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionScriptInstanceDataPtr,
        p_method: GDExtensionConstStringNamePtr,
        p_args: *const GDExtensionConstVariantPtr,
        p_argument_count: GDExtensionInt,
        r_return: GDExtensionVariantPtr,
        r_error: *mut GDExtensionCallError,
    ),
>;
pub type GDExtensionScriptInstanceNotification = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr, p_what: i32),
>;
pub type GDExtensionScriptInstanceToString = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
        r_is_valid: *mut GDExtensionBool,
        r_out: GDExtensionStringPtr,
    ),
>;
pub type GDExtensionScriptInstanceRefCountIncremented =
    ::std::option::Option<unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr)>;
pub type GDExtensionScriptInstanceRefCountDecremented = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr) -> GDExtensionBool,
>;
pub type GDExtensionScriptInstanceGetScript = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr) -> GDExtensionObjectPtr,
>;
pub type GDExtensionScriptInstanceIsPlaceholder = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr) -> GDExtensionBool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextScriptLanguage {
    _unused: [u8; 0],
}
pub type GDExtensionScriptLanguagePtr = *mut __GdextScriptLanguage;
pub type GDExtensionScriptInstanceGetLanguage = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionScriptInstanceDataPtr,
    ) -> GDExtensionScriptLanguagePtr,
>;
pub type GDExtensionScriptInstanceFree =
    ::std::option::Option<unsafe extern "C" fn(p_instance: GDExtensionScriptInstanceDataPtr)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GdextScriptInstance {
    _unused: [u8; 0],
}
pub type GDExtensionScriptInstancePtr = *mut __GdextScriptInstance;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionScriptInstanceInfo {
    pub set_func: GDExtensionScriptInstanceSet,
    pub get_func: GDExtensionScriptInstanceGet,
    pub get_property_list_func: GDExtensionScriptInstanceGetPropertyList,
    pub free_property_list_func: GDExtensionScriptInstanceFreePropertyList,
    pub property_can_revert_func: GDExtensionScriptInstancePropertyCanRevert,
    pub property_get_revert_func: GDExtensionScriptInstancePropertyGetRevert,
    pub get_owner_func: GDExtensionScriptInstanceGetOwner,
    pub get_property_state_func: GDExtensionScriptInstanceGetPropertyState,
    pub get_method_list_func: GDExtensionScriptInstanceGetMethodList,
    pub free_method_list_func: GDExtensionScriptInstanceFreeMethodList,
    pub get_property_type_func: GDExtensionScriptInstanceGetPropertyType,
    pub has_method_func: GDExtensionScriptInstanceHasMethod,
    pub call_func: GDExtensionScriptInstanceCall,
    pub notification_func: GDExtensionScriptInstanceNotification,
    pub to_string_func: GDExtensionScriptInstanceToString,
    pub refcount_incremented_func: GDExtensionScriptInstanceRefCountIncremented,
    pub refcount_decremented_func: GDExtensionScriptInstanceRefCountDecremented,
    pub get_script_func: GDExtensionScriptInstanceGetScript,
    pub is_placeholder_func: GDExtensionScriptInstanceIsPlaceholder,
    pub set_fallback_func: GDExtensionScriptInstanceSet,
    pub get_fallback_func: GDExtensionScriptInstanceGet,
    pub get_language_func: GDExtensionScriptInstanceGetLanguage,
    pub free_func: GDExtensionScriptInstanceFree,
}
#[test]
fn bindgen_test_layout_GDExtensionScriptInstanceInfo() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionScriptInstanceInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionScriptInstanceInfo>(),
        184usize,
        concat!("Size of: ", stringify!(GDExtensionScriptInstanceInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionScriptInstanceInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionScriptInstanceInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(set_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_property_list_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_property_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_property_list_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(free_property_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_can_revert_func) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(property_can_revert_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_get_revert_func) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(property_get_revert_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_owner_func) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_owner_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_property_state_func) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_property_state_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_method_list_func) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_method_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_method_list_func) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(free_method_list_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_property_type_func) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_property_type_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_method_func) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(has_method_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).call_func) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(call_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).notification_func) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(notification_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_string_func) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(to_string_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refcount_incremented_func) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(refcount_incremented_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refcount_decremented_func) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(refcount_decremented_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_script_func) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_script_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_placeholder_func) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(is_placeholder_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_fallback_func) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(set_fallback_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_fallback_func) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_fallback_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_language_func) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(get_language_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_func) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionScriptInstanceInfo),
            "::",
            stringify!(free_func)
        )
    );
}
pub const GDEXTENSION_INITIALIZATION_CORE: GDExtensionInitializationLevel = 0;
pub const GDEXTENSION_INITIALIZATION_SERVERS: GDExtensionInitializationLevel = 1;
pub const GDEXTENSION_INITIALIZATION_SCENE: GDExtensionInitializationLevel = 2;
pub const GDEXTENSION_INITIALIZATION_EDITOR: GDExtensionInitializationLevel = 3;
pub const GDEXTENSION_MAX_INITIALIZATION_LEVEL: GDExtensionInitializationLevel = 4;
pub type GDExtensionInitializationLevel = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionInitialization {
    pub minimum_initialization_level: GDExtensionInitializationLevel,
    pub userdata: *mut ::std::os::raw::c_void,
    pub initialize: ::std::option::Option<
        unsafe extern "C" fn(
            userdata: *mut ::std::os::raw::c_void,
            p_level: GDExtensionInitializationLevel,
        ),
    >,
    pub deinitialize: ::std::option::Option<
        unsafe extern "C" fn(
            userdata: *mut ::std::os::raw::c_void,
            p_level: GDExtensionInitializationLevel,
        ),
    >,
}
#[test]
fn bindgen_test_layout_GDExtensionInitialization() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionInitialization> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionInitialization>(),
        32usize,
        concat!("Size of: ", stringify!(GDExtensionInitialization))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionInitialization>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionInitialization))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).minimum_initialization_level) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInitialization),
            "::",
            stringify!(minimum_initialization_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).userdata) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInitialization),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInitialization),
            "::",
            stringify!(initialize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deinitialize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionInitialization),
            "::",
            stringify!(deinitialize)
        )
    );
}
pub type GDExtensionInterfaceFunctionPtr = ::std::option::Option<unsafe extern "C" fn()>;
pub type GDExtensionInterfaceGetProcAddress = ::std::option::Option<
    unsafe extern "C" fn(
        p_function_name: *const ::std::os::raw::c_char,
    ) -> GDExtensionInterfaceFunctionPtr,
>;
pub type GDExtensionInitializationFunction = ::std::option::Option<
    unsafe extern "C" fn(
        p_get_proc_address: GDExtensionInterfaceGetProcAddress,
        p_library: GDExtensionClassLibraryPtr,
        r_initialization: *mut GDExtensionInitialization,
    ) -> GDExtensionBool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDExtensionGodotVersion {
    pub major: u32,
    pub minor: u32,
    pub patch: u32,
    pub string: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_GDExtensionGodotVersion() {
    const UNINIT: ::std::mem::MaybeUninit<GDExtensionGodotVersion> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GDExtensionGodotVersion>(),
        24usize,
        concat!("Size of: ", stringify!(GDExtensionGodotVersion))
    );
    assert_eq!(
        ::std::mem::align_of::<GDExtensionGodotVersion>(),
        8usize,
        concat!("Alignment of ", stringify!(GDExtensionGodotVersion))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).major) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionGodotVersion),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minor) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionGodotVersion),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).patch) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionGodotVersion),
            "::",
            stringify!(patch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GDExtensionGodotVersion),
            "::",
            stringify!(string)
        )
    );
}
#[doc = " @name get_godot_version\n @since 4.1\n\n Gets the Godot version that the GDExtension was loaded into.\n\n @param r_godot_version A pointer to the structure to write the version information into."]
pub type GDExtensionInterfaceGetGodotVersion =
    ::std::option::Option<unsafe extern "C" fn(r_godot_version: *mut GDExtensionGodotVersion)>;
#[doc = " @name mem_alloc\n @since 4.1\n\n Allocates memory.\n\n @param p_bytes The amount of memory to allocate in bytes.\n\n @return A pointer to the allocated memory, or NULL if unsuccessful."]
pub type GDExtensionInterfaceMemAlloc =
    ::std::option::Option<unsafe extern "C" fn(p_bytes: usize) -> *mut ::std::os::raw::c_void>;
#[doc = " @name mem_realloc\n @since 4.1\n\n Reallocates memory.\n\n @param p_ptr A pointer to the previously allocated memory.\n @param p_bytes The number of bytes to resize the memory block to.\n\n @return A pointer to the allocated memory, or NULL if unsuccessful."]
pub type GDExtensionInterfaceMemRealloc = ::std::option::Option<
    unsafe extern "C" fn(
        p_ptr: *mut ::std::os::raw::c_void,
        p_bytes: usize,
    ) -> *mut ::std::os::raw::c_void,
>;
#[doc = " @name mem_free\n @since 4.1\n\n Frees memory.\n\n @param p_ptr A pointer to the previously allocated memory."]
pub type GDExtensionInterfaceMemFree =
    ::std::option::Option<unsafe extern "C" fn(p_ptr: *mut ::std::os::raw::c_void)>;
#[doc = " @name print_error\n @since 4.1\n\n Logs an error to Godot's built-in debugger and to the OS terminal.\n\n @param p_description The code trigging the error.\n @param p_function The function name where the error occurred.\n @param p_file The file where the error occurred.\n @param p_line The line where the error occurred.\n @param p_editor_notify Whether or not to notify the editor."]
pub type GDExtensionInterfacePrintError = ::std::option::Option<
    unsafe extern "C" fn(
        p_description: *const ::std::os::raw::c_char,
        p_function: *const ::std::os::raw::c_char,
        p_file: *const ::std::os::raw::c_char,
        p_line: i32,
        p_editor_notify: GDExtensionBool,
    ),
>;
#[doc = " @name print_error_with_message\n @since 4.1\n\n Logs an error with a message to Godot's built-in debugger and to the OS terminal.\n\n @param p_description The code trigging the error.\n @param p_message The message to show along with the error.\n @param p_function The function name where the error occurred.\n @param p_file The file where the error occurred.\n @param p_line The line where the error occurred.\n @param p_editor_notify Whether or not to notify the editor."]
pub type GDExtensionInterfacePrintErrorWithMessage = ::std::option::Option<
    unsafe extern "C" fn(
        p_description: *const ::std::os::raw::c_char,
        p_message: *const ::std::os::raw::c_char,
        p_function: *const ::std::os::raw::c_char,
        p_file: *const ::std::os::raw::c_char,
        p_line: i32,
        p_editor_notify: GDExtensionBool,
    ),
>;
#[doc = " @name print_warning\n @since 4.1\n\n Logs a warning to Godot's built-in debugger and to the OS terminal.\n\n @param p_description The code trigging the warning.\n @param p_function The function name where the warning occurred.\n @param p_file The file where the warning occurred.\n @param p_line The line where the warning occurred.\n @param p_editor_notify Whether or not to notify the editor."]
pub type GDExtensionInterfacePrintWarning = ::std::option::Option<
    unsafe extern "C" fn(
        p_description: *const ::std::os::raw::c_char,
        p_function: *const ::std::os::raw::c_char,
        p_file: *const ::std::os::raw::c_char,
        p_line: i32,
        p_editor_notify: GDExtensionBool,
    ),
>;
#[doc = " @name print_warning_with_message\n @since 4.1\n\n Logs a warning with a message to Godot's built-in debugger and to the OS terminal.\n\n @param p_description The code trigging the warning.\n @param p_message The message to show along with the warning.\n @param p_function The function name where the warning occurred.\n @param p_file The file where the warning occurred.\n @param p_line The line where the warning occurred.\n @param p_editor_notify Whether or not to notify the editor."]
pub type GDExtensionInterfacePrintWarningWithMessage = ::std::option::Option<
    unsafe extern "C" fn(
        p_description: *const ::std::os::raw::c_char,
        p_message: *const ::std::os::raw::c_char,
        p_function: *const ::std::os::raw::c_char,
        p_file: *const ::std::os::raw::c_char,
        p_line: i32,
        p_editor_notify: GDExtensionBool,
    ),
>;
#[doc = " @name print_script_error\n @since 4.1\n\n Logs a script error to Godot's built-in debugger and to the OS terminal.\n\n @param p_description The code trigging the error.\n @param p_function The function name where the error occurred.\n @param p_file The file where the error occurred.\n @param p_line The line where the error occurred.\n @param p_editor_notify Whether or not to notify the editor."]
pub type GDExtensionInterfacePrintScriptError = ::std::option::Option<
    unsafe extern "C" fn(
        p_description: *const ::std::os::raw::c_char,
        p_function: *const ::std::os::raw::c_char,
        p_file: *const ::std::os::raw::c_char,
        p_line: i32,
        p_editor_notify: GDExtensionBool,
    ),
>;
#[doc = " @name print_script_error_with_message\n @since 4.1\n\n Logs a script error with a message to Godot's built-in debugger and to the OS terminal.\n\n @param p_description The code trigging the error.\n @param p_message The message to show along with the error.\n @param p_function The function name where the error occurred.\n @param p_file The file where the error occurred.\n @param p_line The line where the error occurred.\n @param p_editor_notify Whether or not to notify the editor."]
pub type GDExtensionInterfacePrintScriptErrorWithMessage = ::std::option::Option<
    unsafe extern "C" fn(
        p_description: *const ::std::os::raw::c_char,
        p_message: *const ::std::os::raw::c_char,
        p_function: *const ::std::os::raw::c_char,
        p_file: *const ::std::os::raw::c_char,
        p_line: i32,
        p_editor_notify: GDExtensionBool,
    ),
>;
#[doc = " @name get_native_struct_size\n @since 4.1\n\n Gets the size of a native struct (ex. ObjectID) in bytes.\n\n @param p_name A pointer to a StringName identifying the struct name.\n\n @return The size in bytes."]
pub type GDExtensionInterfaceGetNativeStructSize =
    ::std::option::Option<unsafe extern "C" fn(p_name: GDExtensionConstStringNamePtr) -> u64>;
#[doc = " @name variant_new_copy\n @since 4.1\n\n Copies one Variant into a another.\n\n @param r_dest A pointer to the destination Variant.\n @param p_src A pointer to the source Variant."]
pub type GDExtensionInterfaceVariantNewCopy = ::std::option::Option<
    unsafe extern "C" fn(
        r_dest: GDExtensionUninitializedVariantPtr,
        p_src: GDExtensionConstVariantPtr,
    ),
>;
#[doc = " @name variant_new_nil\n @since 4.1\n\n Creates a new Variant containing nil.\n\n @param r_dest A pointer to the destination Variant."]
pub type GDExtensionInterfaceVariantNewNil =
    ::std::option::Option<unsafe extern "C" fn(r_dest: GDExtensionUninitializedVariantPtr)>;
#[doc = " @name variant_destroy\n @since 4.1\n\n Destroys a Variant.\n\n @param p_self A pointer to the Variant to destroy."]
pub type GDExtensionInterfaceVariantDestroy =
    ::std::option::Option<unsafe extern "C" fn(p_self: GDExtensionVariantPtr)>;
#[doc = " @name variant_call\n @since 4.1\n\n Calls a method on a Variant.\n\n @param p_self A pointer to the Variant.\n @param p_method A pointer to a StringName identifying the method.\n @param p_args A pointer to a C array of Variant.\n @param p_argument_count The number of arguments.\n @param r_return A pointer a Variant which will be assigned the return value.\n @param r_error A pointer the structure which will hold error information.\n\n @see Variant::callp()"]
pub type GDExtensionInterfaceVariantCall = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionVariantPtr,
        p_method: GDExtensionConstStringNamePtr,
        p_args: *const GDExtensionConstVariantPtr,
        p_argument_count: GDExtensionInt,
        r_return: GDExtensionUninitializedVariantPtr,
        r_error: *mut GDExtensionCallError,
    ),
>;
#[doc = " @name variant_call_static\n @since 4.1\n\n Calls a static method on a Variant.\n\n @param p_self A pointer to the Variant.\n @param p_method A pointer to a StringName identifying the method.\n @param p_args A pointer to a C array of Variant.\n @param p_argument_count The number of arguments.\n @param r_return A pointer a Variant which will be assigned the return value.\n @param r_error A pointer the structure which will be updated with error information.\n\n @see Variant::call_static()"]
pub type GDExtensionInterfaceVariantCallStatic = ::std::option::Option<
    unsafe extern "C" fn(
        p_type: GDExtensionVariantType,
        p_method: GDExtensionConstStringNamePtr,
        p_args: *const GDExtensionConstVariantPtr,
        p_argument_count: GDExtensionInt,
        r_return: GDExtensionUninitializedVariantPtr,
        r_error: *mut GDExtensionCallError,
    ),
>;
#[doc = " @name variant_evaluate\n @since 4.1\n\n Evaluate an operator on two Variants.\n\n @param p_op The operator to evaluate.\n @param p_a The first Variant.\n @param p_b The second Variant.\n @param r_return A pointer a Variant which will be assigned the return value.\n @param r_valid A pointer to a boolean which will be set to false if the operation is invalid.\n\n @see Variant::evaluate()"]
pub type GDExtensionInterfaceVariantEvaluate = ::std::option::Option<
    unsafe extern "C" fn(
        p_op: GDExtensionVariantOperator,
        p_a: GDExtensionConstVariantPtr,
        p_b: GDExtensionConstVariantPtr,
        r_return: GDExtensionUninitializedVariantPtr,
        r_valid: *mut GDExtensionBool,
    ),
>;
#[doc = " @name variant_set\n @since 4.1\n\n Sets a key on a Variant to a value.\n\n @param p_self A pointer to the Variant.\n @param p_key A pointer to a Variant representing the key.\n @param p_value A pointer to a Variant representing the value.\n @param r_valid A pointer to a boolean which will be set to false if the operation is invalid.\n\n @see Variant::set()"]
pub type GDExtensionInterfaceVariantSet = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionVariantPtr,
        p_key: GDExtensionConstVariantPtr,
        p_value: GDExtensionConstVariantPtr,
        r_valid: *mut GDExtensionBool,
    ),
>;
#[doc = " @name variant_set_named\n @since 4.1\n\n Sets a named key on a Variant to a value.\n\n @param p_self A pointer to the Variant.\n @param p_key A pointer to a StringName representing the key.\n @param p_value A pointer to a Variant representing the value.\n @param r_valid A pointer to a boolean which will be set to false if the operation is invalid.\n\n @see Variant::set_named()"]
pub type GDExtensionInterfaceVariantSetNamed = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionVariantPtr,
        p_key: GDExtensionConstStringNamePtr,
        p_value: GDExtensionConstVariantPtr,
        r_valid: *mut GDExtensionBool,
    ),
>;
#[doc = " @name variant_set_keyed\n @since 4.1\n\n Sets a keyed property on a Variant to a value.\n\n @param p_self A pointer to the Variant.\n @param p_key A pointer to a Variant representing the key.\n @param p_value A pointer to a Variant representing the value.\n @param r_valid A pointer to a boolean which will be set to false if the operation is invalid.\n\n @see Variant::set_keyed()"]
pub type GDExtensionInterfaceVariantSetKeyed = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionVariantPtr,
        p_key: GDExtensionConstVariantPtr,
        p_value: GDExtensionConstVariantPtr,
        r_valid: *mut GDExtensionBool,
    ),
>;
#[doc = " @name variant_set_indexed\n @since 4.1\n\n Sets an index on a Variant to a value.\n\n @param p_self A pointer to the Variant.\n @param p_index The index.\n @param p_value A pointer to a Variant representing the value.\n @param r_valid A pointer to a boolean which will be set to false if the operation is invalid.\n @param r_oob A pointer to a boolean which will be set to true if the index is out of bounds."]
pub type GDExtensionInterfaceVariantSetIndexed = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionVariantPtr,
        p_index: GDExtensionInt,
        p_value: GDExtensionConstVariantPtr,
        r_valid: *mut GDExtensionBool,
        r_oob: *mut GDExtensionBool,
    ),
>;
#[doc = " @name variant_get\n @since 4.1\n\n Gets the value of a key from a Variant.\n\n @param p_self A pointer to the Variant.\n @param p_key A pointer to a Variant representing the key.\n @param r_ret A pointer to a Variant which will be assigned the value.\n @param r_valid A pointer to a boolean which will be set to false if the operation is invalid."]
pub type GDExtensionInterfaceVariantGet = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstVariantPtr,
        p_key: GDExtensionConstVariantPtr,
        r_ret: GDExtensionUninitializedVariantPtr,
        r_valid: *mut GDExtensionBool,
    ),
>;
#[doc = " @name variant_get_named\n @since 4.1\n\n Gets the value of a named key from a Variant.\n\n @param p_self A pointer to the Variant.\n @param p_key A pointer to a StringName representing the key.\n @param r_ret A pointer to a Variant which will be assigned the value.\n @param r_valid A pointer to a boolean which will be set to false if the operation is invalid."]
pub type GDExtensionInterfaceVariantGetNamed = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstVariantPtr,
        p_key: GDExtensionConstStringNamePtr,
        r_ret: GDExtensionUninitializedVariantPtr,
        r_valid: *mut GDExtensionBool,
    ),
>;
#[doc = " @name variant_get_keyed\n @since 4.1\n\n Gets the value of a keyed property from a Variant.\n\n @param p_self A pointer to the Variant.\n @param p_key A pointer to a Variant representing the key.\n @param r_ret A pointer to a Variant which will be assigned the value.\n @param r_valid A pointer to a boolean which will be set to false if the operation is invalid."]
pub type GDExtensionInterfaceVariantGetKeyed = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstVariantPtr,
        p_key: GDExtensionConstVariantPtr,
        r_ret: GDExtensionUninitializedVariantPtr,
        r_valid: *mut GDExtensionBool,
    ),
>;
#[doc = " @name variant_get_indexed\n @since 4.1\n\n Gets the value of an index from a Variant.\n\n @param p_self A pointer to the Variant.\n @param p_index The index.\n @param r_ret A pointer to a Variant which will be assigned the value.\n @param r_valid A pointer to a boolean which will be set to false if the operation is invalid.\n @param r_oob A pointer to a boolean which will be set to true if the index is out of bounds."]
pub type GDExtensionInterfaceVariantGetIndexed = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstVariantPtr,
        p_index: GDExtensionInt,
        r_ret: GDExtensionUninitializedVariantPtr,
        r_valid: *mut GDExtensionBool,
        r_oob: *mut GDExtensionBool,
    ),
>;
#[doc = " @name variant_iter_init\n @since 4.1\n\n Initializes an iterator over a Variant.\n\n @param p_self A pointer to the Variant.\n @param r_iter A pointer to a Variant which will be assigned the iterator.\n @param r_valid A pointer to a boolean which will be set to false if the operation is invalid.\n\n @return true if the operation is valid; otherwise false.\n\n @see Variant::iter_init()"]
pub type GDExtensionInterfaceVariantIterInit = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstVariantPtr,
        r_iter: GDExtensionUninitializedVariantPtr,
        r_valid: *mut GDExtensionBool,
    ) -> GDExtensionBool,
>;
#[doc = " @name variant_iter_next\n @since 4.1\n\n Gets the next value for an iterator over a Variant.\n\n @param p_self A pointer to the Variant.\n @param r_iter A pointer to a Variant which will be assigned the iterator.\n @param r_valid A pointer to a boolean which will be set to false if the operation is invalid.\n\n @return true if the operation is valid; otherwise false.\n\n @see Variant::iter_next()"]
pub type GDExtensionInterfaceVariantIterNext = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstVariantPtr,
        r_iter: GDExtensionVariantPtr,
        r_valid: *mut GDExtensionBool,
    ) -> GDExtensionBool,
>;
#[doc = " @name variant_iter_get\n @since 4.1\n\n Gets the next value for an iterator over a Variant.\n\n @param p_self A pointer to the Variant.\n @param r_iter A pointer to a Variant which will be assigned the iterator.\n @param r_ret A pointer to a Variant which will be assigned false if the operation is invalid.\n @param r_valid A pointer to a boolean which will be set to false if the operation is invalid.\n\n @see Variant::iter_get()"]
pub type GDExtensionInterfaceVariantIterGet = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstVariantPtr,
        r_iter: GDExtensionVariantPtr,
        r_ret: GDExtensionUninitializedVariantPtr,
        r_valid: *mut GDExtensionBool,
    ),
>;
#[doc = " @name variant_hash\n @since 4.1\n\n Gets the hash of a Variant.\n\n @param p_self A pointer to the Variant.\n\n @return The hash value.\n\n @see Variant::hash()"]
pub type GDExtensionInterfaceVariantHash = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionConstVariantPtr) -> GDExtensionInt,
>;
#[doc = " @name variant_recursive_hash\n @since 4.1\n\n Gets the recursive hash of a Variant.\n\n @param p_self A pointer to the Variant.\n @param p_recursion_count The number of recursive loops so far.\n\n @return The hash value.\n\n @see Variant::recursive_hash()"]
pub type GDExtensionInterfaceVariantRecursiveHash = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstVariantPtr,
        p_recursion_count: GDExtensionInt,
    ) -> GDExtensionInt,
>;
#[doc = " @name variant_hash_compare\n @since 4.1\n\n Compares two Variants by their hash.\n\n @param p_self A pointer to the Variant.\n @param p_other A pointer to the other Variant to compare it to.\n\n @return The hash value.\n\n @see Variant::hash_compare()"]
pub type GDExtensionInterfaceVariantHashCompare = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstVariantPtr,
        p_other: GDExtensionConstVariantPtr,
    ) -> GDExtensionBool,
>;
#[doc = " @name variant_booleanize\n @since 4.1\n\n Converts a Variant to a boolean.\n\n @param p_self A pointer to the Variant.\n\n @return The boolean value of the Variant."]
pub type GDExtensionInterfaceVariantBooleanize = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionConstVariantPtr) -> GDExtensionBool,
>;
#[doc = " @name variant_duplicate\n @since 4.1\n\n Duplicates a Variant.\n\n @param p_self A pointer to the Variant.\n @param r_ret A pointer to a Variant to store the duplicated value.\n @param p_deep Whether or not to duplicate deeply (when supported by the Variant type)."]
pub type GDExtensionInterfaceVariantDuplicate = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstVariantPtr,
        r_ret: GDExtensionVariantPtr,
        p_deep: GDExtensionBool,
    ),
>;
#[doc = " @name variant_stringify\n @since 4.1\n\n Converts a Variant to a string.\n\n @param p_self A pointer to the Variant.\n @param r_ret A pointer to a String to store the resulting value."]
pub type GDExtensionInterfaceVariantStringify = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionConstVariantPtr, r_ret: GDExtensionStringPtr),
>;
#[doc = " @name variant_get_type\n @since 4.1\n\n Gets the type of a Variant.\n\n @param p_self A pointer to the Variant.\n\n @return The variant type."]
pub type GDExtensionInterfaceVariantGetType = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionConstVariantPtr) -> GDExtensionVariantType,
>;
#[doc = " @name variant_has_method\n @since 4.1\n\n Checks if a Variant has the given method.\n\n @param p_self A pointer to the Variant.\n @param p_method A pointer to a StringName with the method name.\n\n @return"]
pub type GDExtensionInterfaceVariantHasMethod = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstVariantPtr,
        p_method: GDExtensionConstStringNamePtr,
    ) -> GDExtensionBool,
>;
#[doc = " @name variant_has_member\n @since 4.1\n\n Checks if a type of Variant has the given member.\n\n @param p_type The Variant type.\n @param p_member A pointer to a StringName with the member name.\n\n @return"]
pub type GDExtensionInterfaceVariantHasMember = ::std::option::Option<
    unsafe extern "C" fn(
        p_type: GDExtensionVariantType,
        p_member: GDExtensionConstStringNamePtr,
    ) -> GDExtensionBool,
>;
#[doc = " @name variant_has_key\n @since 4.1\n\n Checks if a Variant has a key.\n\n @param p_self A pointer to the Variant.\n @param p_key A pointer to a Variant representing the key.\n @param r_valid A pointer to a boolean which will be set to false if the key doesn't exist.\n\n @return true if the key exists; otherwise false."]
pub type GDExtensionInterfaceVariantHasKey = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstVariantPtr,
        p_key: GDExtensionConstVariantPtr,
        r_valid: *mut GDExtensionBool,
    ) -> GDExtensionBool,
>;
#[doc = " @name variant_get_type_name\n @since 4.1\n\n Gets the name of a Variant type.\n\n @param p_type The Variant type.\n @param r_name A pointer to a String to store the Variant type name."]
pub type GDExtensionInterfaceVariantGetTypeName = ::std::option::Option<
    unsafe extern "C" fn(p_type: GDExtensionVariantType, r_name: GDExtensionUninitializedStringPtr),
>;
#[doc = " @name variant_can_convert\n @since 4.1\n\n Checks if Variants can be converted from one type to another.\n\n @param p_from The Variant type to convert from.\n @param p_to The Variant type to convert to.\n\n @return true if the conversion is possible; otherwise false."]
pub type GDExtensionInterfaceVariantCanConvert = ::std::option::Option<
    unsafe extern "C" fn(
        p_from: GDExtensionVariantType,
        p_to: GDExtensionVariantType,
    ) -> GDExtensionBool,
>;
#[doc = " @name variant_can_convert_strict\n @since 4.1\n\n Checks if Variant can be converted from one type to another using stricter rules.\n\n @param p_from The Variant type to convert from.\n @param p_to The Variant type to convert to.\n\n @return true if the conversion is possible; otherwise false."]
pub type GDExtensionInterfaceVariantCanConvertStrict = ::std::option::Option<
    unsafe extern "C" fn(
        p_from: GDExtensionVariantType,
        p_to: GDExtensionVariantType,
    ) -> GDExtensionBool,
>;
#[doc = " @name get_variant_from_type_constructor\n @since 4.1\n\n Gets a pointer to a function that can create a Variant of the given type from a raw value.\n\n @param p_type The Variant type.\n\n @return A pointer to a function that can create a Variant of the given type from a raw value."]
pub type GDExtensionInterfaceGetVariantFromTypeConstructor = ::std::option::Option<
    unsafe extern "C" fn(
        p_type: GDExtensionVariantType,
    ) -> GDExtensionVariantFromTypeConstructorFunc,
>;
#[doc = " @name get_variant_to_type_constructor\n @since 4.1\n\n Gets a pointer to a function that can get the raw value from a Variant of the given type.\n\n @param p_type The Variant type.\n\n @return A pointer to a function that can get the raw value from a Variant of the given type."]
pub type GDExtensionInterfaceGetVariantToTypeConstructor = ::std::option::Option<
    unsafe extern "C" fn(
        p_type: GDExtensionVariantType,
    ) -> GDExtensionTypeFromVariantConstructorFunc,
>;
#[doc = " @name variant_get_ptr_operator_evaluator\n @since 4.1\n\n Gets a pointer to a function that can evaluate the given Variant operator on the given Variant types.\n\n @param p_operator The variant operator.\n @param p_type_a The type of the first Variant.\n @param p_type_b The type of the second Variant.\n\n @return A pointer to a function that can evaluate the given Variant operator on the given Variant types."]
pub type GDExtensionInterfaceVariantGetPtrOperatorEvaluator = ::std::option::Option<
    unsafe extern "C" fn(
        p_operator: GDExtensionVariantOperator,
        p_type_a: GDExtensionVariantType,
        p_type_b: GDExtensionVariantType,
    ) -> GDExtensionPtrOperatorEvaluator,
>;
#[doc = " @name variant_get_ptr_builtin_method\n @since 4.1\n\n Gets a pointer to a function that can call a builtin method on a type of Variant.\n\n @param p_type The Variant type.\n @param p_method A pointer to a StringName with the method name.\n @param p_hash A hash representing the method signature.\n\n @return A pointer to a function that can call a builtin method on a type of Variant."]
pub type GDExtensionInterfaceVariantGetPtrBuiltinMethod = ::std::option::Option<
    unsafe extern "C" fn(
        p_type: GDExtensionVariantType,
        p_method: GDExtensionConstStringNamePtr,
        p_hash: GDExtensionInt,
    ) -> GDExtensionPtrBuiltInMethod,
>;
#[doc = " @name variant_get_ptr_constructor\n @since 4.1\n\n Gets a pointer to a function that can call one of the constructors for a type of Variant.\n\n @param p_type The Variant type.\n @param p_constructor The index of the constructor.\n\n @return A pointer to a function that can call one of the constructors for a type of Variant."]
pub type GDExtensionInterfaceVariantGetPtrConstructor = ::std::option::Option<
    unsafe extern "C" fn(
        p_type: GDExtensionVariantType,
        p_constructor: i32,
    ) -> GDExtensionPtrConstructor,
>;
#[doc = " @name variant_get_ptr_destructor\n @since 4.1\n\n Gets a pointer to a function than can call the destructor for a type of Variant.\n\n @param p_type The Variant type.\n\n @return A pointer to a function than can call the destructor for a type of Variant."]
pub type GDExtensionInterfaceVariantGetPtrDestructor = ::std::option::Option<
    unsafe extern "C" fn(p_type: GDExtensionVariantType) -> GDExtensionPtrDestructor,
>;
#[doc = " @name variant_construct\n @since 4.1\n\n Constructs a Variant of the given type, using the first constructor that matches the given arguments.\n\n @param p_type The Variant type.\n @param p_base A pointer to a Variant to store the constructed value.\n @param p_args A pointer to a C array of Variant pointers representing the arguments for the constructor.\n @param p_argument_count The number of arguments to pass to the constructor.\n @param r_error A pointer the structure which will be updated with error information."]
pub type GDExtensionInterfaceVariantConstruct = ::std::option::Option<
    unsafe extern "C" fn(
        p_type: GDExtensionVariantType,
        r_base: GDExtensionUninitializedVariantPtr,
        p_args: *const GDExtensionConstVariantPtr,
        p_argument_count: i32,
        r_error: *mut GDExtensionCallError,
    ),
>;
#[doc = " @name variant_get_ptr_setter\n @since 4.1\n\n Gets a pointer to a function that can call a member's setter on the given Variant type.\n\n @param p_type The Variant type.\n @param p_member A pointer to a StringName with the member name.\n\n @return A pointer to a function that can call a member's setter on the given Variant type."]
pub type GDExtensionInterfaceVariantGetPtrSetter = ::std::option::Option<
    unsafe extern "C" fn(
        p_type: GDExtensionVariantType,
        p_member: GDExtensionConstStringNamePtr,
    ) -> GDExtensionPtrSetter,
>;
#[doc = " @name variant_get_ptr_getter\n @since 4.1\n\n Gets a pointer to a function that can call a member's getter on the given Variant type.\n\n @param p_type The Variant type.\n @param p_member A pointer to a StringName with the member name.\n\n @return A pointer to a function that can call a member's getter on the given Variant type."]
pub type GDExtensionInterfaceVariantGetPtrGetter = ::std::option::Option<
    unsafe extern "C" fn(
        p_type: GDExtensionVariantType,
        p_member: GDExtensionConstStringNamePtr,
    ) -> GDExtensionPtrGetter,
>;
#[doc = " @name variant_get_ptr_indexed_setter\n @since 4.1\n\n Gets a pointer to a function that can set an index on the given Variant type.\n\n @param p_type The Variant type.\n\n @return A pointer to a function that can set an index on the given Variant type."]
pub type GDExtensionInterfaceVariantGetPtrIndexedSetter = ::std::option::Option<
    unsafe extern "C" fn(p_type: GDExtensionVariantType) -> GDExtensionPtrIndexedSetter,
>;
#[doc = " @name variant_get_ptr_indexed_getter\n @since 4.1\n\n Gets a pointer to a function that can get an index on the given Variant type.\n\n @param p_type The Variant type.\n\n @return A pointer to a function that can get an index on the given Variant type."]
pub type GDExtensionInterfaceVariantGetPtrIndexedGetter = ::std::option::Option<
    unsafe extern "C" fn(p_type: GDExtensionVariantType) -> GDExtensionPtrIndexedGetter,
>;
#[doc = " @name variant_get_ptr_keyed_setter\n @since 4.1\n\n Gets a pointer to a function that can set a key on the given Variant type.\n\n @param p_type The Variant type.\n\n @return A pointer to a function that can set a key on the given Variant type."]
pub type GDExtensionInterfaceVariantGetPtrKeyedSetter = ::std::option::Option<
    unsafe extern "C" fn(p_type: GDExtensionVariantType) -> GDExtensionPtrKeyedSetter,
>;
#[doc = " @name variant_get_ptr_keyed_getter\n @since 4.1\n\n Gets a pointer to a function that can get a key on the given Variant type.\n\n @param p_type The Variant type.\n\n @return A pointer to a function that can get a key on the given Variant type."]
pub type GDExtensionInterfaceVariantGetPtrKeyedGetter = ::std::option::Option<
    unsafe extern "C" fn(p_type: GDExtensionVariantType) -> GDExtensionPtrKeyedGetter,
>;
#[doc = " @name variant_get_ptr_keyed_checker\n @since 4.1\n\n Gets a pointer to a function that can check a key on the given Variant type.\n\n @param p_type The Variant type.\n\n @return A pointer to a function that can check a key on the given Variant type."]
pub type GDExtensionInterfaceVariantGetPtrKeyedChecker = ::std::option::Option<
    unsafe extern "C" fn(p_type: GDExtensionVariantType) -> GDExtensionPtrKeyedChecker,
>;
#[doc = " @name variant_get_constant_value\n @since 4.1\n\n Gets the value of a constant from the given Variant type.\n\n @param p_type The Variant type.\n @param p_constant A pointer to a StringName with the constant name.\n @param r_ret A pointer to a Variant to store the value."]
pub type GDExtensionInterfaceVariantGetConstantValue = ::std::option::Option<
    unsafe extern "C" fn(
        p_type: GDExtensionVariantType,
        p_constant: GDExtensionConstStringNamePtr,
        r_ret: GDExtensionUninitializedVariantPtr,
    ),
>;
#[doc = " @name variant_get_ptr_utility_function\n @since 4.1\n\n Gets a pointer to a function that can call a Variant utility function.\n\n @param p_function A pointer to a StringName with the function name.\n @param p_hash A hash representing the function signature.\n\n @return A pointer to a function that can call a Variant utility function."]
pub type GDExtensionInterfaceVariantGetPtrUtilityFunction = ::std::option::Option<
    unsafe extern "C" fn(
        p_function: GDExtensionConstStringNamePtr,
        p_hash: GDExtensionInt,
    ) -> GDExtensionPtrUtilityFunction,
>;
#[doc = " @name string_new_with_latin1_chars\n @since 4.1\n\n Creates a String from a Latin-1 encoded C string.\n\n @param r_dest A pointer to a Variant to hold the newly created String.\n @param p_contents A pointer to a Latin-1 encoded C string (null terminated)."]
pub type GDExtensionInterfaceStringNewWithLatin1Chars = ::std::option::Option<
    unsafe extern "C" fn(
        r_dest: GDExtensionUninitializedStringPtr,
        p_contents: *const ::std::os::raw::c_char,
    ),
>;
#[doc = " @name string_new_with_utf8_chars\n @since 4.1\n\n Creates a String from a UTF-8 encoded C string.\n\n @param r_dest A pointer to a Variant to hold the newly created String.\n @param p_contents A pointer to a UTF-8 encoded C string (null terminated)."]
pub type GDExtensionInterfaceStringNewWithUtf8Chars = ::std::option::Option<
    unsafe extern "C" fn(
        r_dest: GDExtensionUninitializedStringPtr,
        p_contents: *const ::std::os::raw::c_char,
    ),
>;
#[doc = " @name string_new_with_utf16_chars\n @since 4.1\n\n Creates a String from a UTF-16 encoded C string.\n\n @param r_dest A pointer to a Variant to hold the newly created String.\n @param p_contents A pointer to a UTF-16 encoded C string (null terminated)."]
pub type GDExtensionInterfaceStringNewWithUtf16Chars = ::std::option::Option<
    unsafe extern "C" fn(r_dest: GDExtensionUninitializedStringPtr, p_contents: *const char16_t),
>;
#[doc = " @name string_new_with_utf32_chars\n @since 4.1\n\n Creates a String from a UTF-32 encoded C string.\n\n @param r_dest A pointer to a Variant to hold the newly created String.\n @param p_contents A pointer to a UTF-32 encoded C string (null terminated)."]
pub type GDExtensionInterfaceStringNewWithUtf32Chars = ::std::option::Option<
    unsafe extern "C" fn(r_dest: GDExtensionUninitializedStringPtr, p_contents: *const char32_t),
>;
#[doc = " @name string_new_with_wide_chars\n @since 4.1\n\n Creates a String from a wide C string.\n\n @param r_dest A pointer to a Variant to hold the newly created String.\n @param p_contents A pointer to a wide C string (null terminated)."]
pub type GDExtensionInterfaceStringNewWithWideChars = ::std::option::Option<
    unsafe extern "C" fn(r_dest: GDExtensionUninitializedStringPtr, p_contents: *const wchar_t),
>;
#[doc = " @name string_new_with_latin1_chars_and_len\n @since 4.1\n\n Creates a String from a Latin-1 encoded C string with the given length.\n\n @param r_dest A pointer to a Variant to hold the newly created String.\n @param p_contents A pointer to a Latin-1 encoded C string.\n @param p_size The number of characters."]
pub type GDExtensionInterfaceStringNewWithLatin1CharsAndLen = ::std::option::Option<
    unsafe extern "C" fn(
        r_dest: GDExtensionUninitializedStringPtr,
        p_contents: *const ::std::os::raw::c_char,
        p_size: GDExtensionInt,
    ),
>;
#[doc = " @name string_new_with_utf8_chars_and_len\n @since 4.1\n\n Creates a String from a UTF-8 encoded C string with the given length.\n\n @param r_dest A pointer to a Variant to hold the newly created String.\n @param p_contents A pointer to a UTF-8 encoded C string.\n @param p_size The number of characters."]
pub type GDExtensionInterfaceStringNewWithUtf8CharsAndLen = ::std::option::Option<
    unsafe extern "C" fn(
        r_dest: GDExtensionUninitializedStringPtr,
        p_contents: *const ::std::os::raw::c_char,
        p_size: GDExtensionInt,
    ),
>;
#[doc = " @name string_new_with_utf16_chars_and_len\n @since 4.1\n\n Creates a String from a UTF-16 encoded C string with the given length.\n\n @param r_dest A pointer to a Variant to hold the newly created String.\n @param p_contents A pointer to a UTF-16 encoded C string.\n @param p_size The number of characters."]
pub type GDExtensionInterfaceStringNewWithUtf16CharsAndLen = ::std::option::Option<
    unsafe extern "C" fn(
        r_dest: GDExtensionUninitializedStringPtr,
        p_contents: *const char16_t,
        p_size: GDExtensionInt,
    ),
>;
#[doc = " @name string_new_with_utf32_chars_and_len\n @since 4.1\n\n Creates a String from a UTF-32 encoded C string with the given length.\n\n @param r_dest A pointer to a Variant to hold the newly created String.\n @param p_contents A pointer to a UTF-32 encoded C string.\n @param p_size The number of characters."]
pub type GDExtensionInterfaceStringNewWithUtf32CharsAndLen = ::std::option::Option<
    unsafe extern "C" fn(
        r_dest: GDExtensionUninitializedStringPtr,
        p_contents: *const char32_t,
        p_size: GDExtensionInt,
    ),
>;
#[doc = " @name string_new_with_wide_chars_and_len\n @since 4.1\n\n Creates a String from a wide C string with the given length.\n\n @param r_dest A pointer to a Variant to hold the newly created String.\n @param p_contents A pointer to a wide C string.\n @param p_size The number of characters."]
pub type GDExtensionInterfaceStringNewWithWideCharsAndLen = ::std::option::Option<
    unsafe extern "C" fn(
        r_dest: GDExtensionUninitializedStringPtr,
        p_contents: *const wchar_t,
        p_size: GDExtensionInt,
    ),
>;
#[doc = " @name string_to_latin1_chars\n @since 4.1\n\n Converts a String to a Latin-1 encoded C string.\n\n It doesn't write a null terminator.\n\n @param p_self A pointer to the String.\n @param r_text A pointer to the buffer to hold the resulting data. If NULL is passed in, only the length will be computed.\n @param p_max_write_length The maximum number of characters that can be written to r_text. It has no affect on the return value.\n\n @return The resulting encoded string length in characters (not bytes), not including a null terminator."]
pub type GDExtensionInterfaceStringToLatin1Chars = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstStringPtr,
        r_text: *mut ::std::os::raw::c_char,
        p_max_write_length: GDExtensionInt,
    ) -> GDExtensionInt,
>;
#[doc = " @name string_to_utf8_chars\n @since 4.1\n\n Converts a String to a UTF-8 encoded C string.\n\n It doesn't write a null terminator.\n\n @param p_self A pointer to the String.\n @param r_text A pointer to the buffer to hold the resulting data. If NULL is passed in, only the length will be computed.\n @param p_max_write_length The maximum number of characters that can be written to r_text. It has no affect on the return value.\n\n @return The resulting encoded string length in characters (not bytes), not including a null terminator."]
pub type GDExtensionInterfaceStringToUtf8Chars = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstStringPtr,
        r_text: *mut ::std::os::raw::c_char,
        p_max_write_length: GDExtensionInt,
    ) -> GDExtensionInt,
>;
#[doc = " @name string_to_utf16_chars\n @since 4.1\n\n Converts a String to a UTF-16 encoded C string.\n\n It doesn't write a null terminator.\n\n @param p_self A pointer to the String.\n @param r_text A pointer to the buffer to hold the resulting data. If NULL is passed in, only the length will be computed.\n @param p_max_write_length The maximum number of characters that can be written to r_text. It has no affect on the return value.\n\n @return The resulting encoded string length in characters (not bytes), not including a null terminator."]
pub type GDExtensionInterfaceStringToUtf16Chars = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstStringPtr,
        r_text: *mut char16_t,
        p_max_write_length: GDExtensionInt,
    ) -> GDExtensionInt,
>;
#[doc = " @name string_to_utf32_chars\n @since 4.1\n\n Converts a String to a UTF-32 encoded C string.\n\n It doesn't write a null terminator.\n\n @param p_self A pointer to the String.\n @param r_text A pointer to the buffer to hold the resulting data. If NULL is passed in, only the length will be computed.\n @param p_max_write_length The maximum number of characters that can be written to r_text. It has no affect on the return value.\n\n @return The resulting encoded string length in characters (not bytes), not including a null terminator."]
pub type GDExtensionInterfaceStringToUtf32Chars = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstStringPtr,
        r_text: *mut char32_t,
        p_max_write_length: GDExtensionInt,
    ) -> GDExtensionInt,
>;
#[doc = " @name string_to_wide_chars\n @since 4.1\n\n Converts a String to a wide C string.\n\n It doesn't write a null terminator.\n\n @param p_self A pointer to the String.\n @param r_text A pointer to the buffer to hold the resulting data. If NULL is passed in, only the length will be computed.\n @param p_max_write_length The maximum number of characters that can be written to r_text. It has no affect on the return value.\n\n @return The resulting encoded string length in characters (not bytes), not including a null terminator."]
pub type GDExtensionInterfaceStringToWideChars = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstStringPtr,
        r_text: *mut wchar_t,
        p_max_write_length: GDExtensionInt,
    ) -> GDExtensionInt,
>;
#[doc = " @name string_operator_index\n @since 4.1\n\n Gets a pointer to the character at the given index from a String.\n\n @param p_self A pointer to the String.\n @param p_index The index.\n\n @return A pointer to the requested character."]
pub type GDExtensionInterfaceStringOperatorIndex = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionStringPtr, p_index: GDExtensionInt) -> *mut char32_t,
>;
#[doc = " @name string_operator_index_const\n @since 4.1\n\n Gets a const pointer to the character at the given index from a String.\n\n @param p_self A pointer to the String.\n @param p_index The index.\n\n @return A const pointer to the requested character."]
pub type GDExtensionInterfaceStringOperatorIndexConst = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstStringPtr,
        p_index: GDExtensionInt,
    ) -> *const char32_t,
>;
#[doc = " @name string_operator_plus_eq_string\n @since 4.1\n\n Appends another String to a String.\n\n @param p_self A pointer to the String.\n @param p_b A pointer to the other String to append."]
pub type GDExtensionInterfaceStringOperatorPlusEqString = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionStringPtr, p_b: GDExtensionConstStringPtr),
>;
#[doc = " @name string_operator_plus_eq_char\n @since 4.1\n\n Appends a character to a String.\n\n @param p_self A pointer to the String.\n @param p_b A pointer to the character to append."]
pub type GDExtensionInterfaceStringOperatorPlusEqChar =
    ::std::option::Option<unsafe extern "C" fn(p_self: GDExtensionStringPtr, p_b: char32_t)>;
#[doc = " @name string_operator_plus_eq_cstr\n @since 4.1\n\n Appends a Latin-1 encoded C string to a String.\n\n @param p_self A pointer to the String.\n @param p_b A pointer to a Latin-1 encoded C string (null terminated)."]
pub type GDExtensionInterfaceStringOperatorPlusEqCstr = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionStringPtr, p_b: *const ::std::os::raw::c_char),
>;
#[doc = " @name string_operator_plus_eq_wcstr\n @since 4.1\n\n Appends a wide C string to a String.\n\n @param p_self A pointer to the String.\n @param p_b A pointer to a wide C string (null terminated)."]
pub type GDExtensionInterfaceStringOperatorPlusEqWcstr =
    ::std::option::Option<unsafe extern "C" fn(p_self: GDExtensionStringPtr, p_b: *const wchar_t)>;
#[doc = " @name string_operator_plus_eq_c32str\n @since 4.1\n\n Appends a UTF-32 encoded C string to a String.\n\n @param p_self A pointer to the String.\n @param p_b A pointer to a UTF-32 encoded C string (null terminated)."]
pub type GDExtensionInterfaceStringOperatorPlusEqC32str =
    ::std::option::Option<unsafe extern "C" fn(p_self: GDExtensionStringPtr, p_b: *const char32_t)>;
#[doc = " @name xml_parser_open_buffer\n @since 4.1\n\n Opens a raw XML buffer on an XMLParser instance.\n\n @param p_instance A pointer to an XMLParser object.\n @param p_buffer A pointer to the buffer.\n @param p_size The size of the buffer.\n\n @return A Godot error code (ex. OK, ERR_INVALID_DATA, etc).\n\n @see XMLParser::open_buffer()"]
pub type GDExtensionInterfaceXmlParserOpenBuffer = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionObjectPtr,
        p_buffer: *const u8,
        p_size: usize,
    ) -> GDExtensionInt,
>;
#[doc = " @name file_access_store_buffer\n @since 4.1\n\n Stores the given buffer using an instance of FileAccess.\n\n @param p_instance A pointer to a FileAccess object.\n @param p_src A pointer to the buffer.\n @param p_length The size of the buffer.\n\n @see FileAccess::store_buffer()"]
pub type GDExtensionInterfaceFileAccessStoreBuffer = ::std::option::Option<
    unsafe extern "C" fn(p_instance: GDExtensionObjectPtr, p_src: *const u8, p_length: u64),
>;
#[doc = " @name file_access_get_buffer\n @since 4.1\n\n Reads the next p_length bytes into the given buffer using an instance of FileAccess.\n\n @param p_instance A pointer to a FileAccess object.\n @param p_dst A pointer to the buffer to store the data.\n @param p_length The requested number of bytes to read.\n\n @return The actual number of bytes read (may be less than requested)."]
pub type GDExtensionInterfaceFileAccessGetBuffer = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionConstObjectPtr,
        p_dst: *mut u8,
        p_length: u64,
    ) -> u64,
>;
#[doc = " @name worker_thread_pool_add_native_group_task\n @since 4.1\n\n Adds a group task to an instance of WorkerThreadPool.\n\n @param p_instance A pointer to a WorkerThreadPool object.\n @param p_func A pointer to a function to run in the thread pool.\n @param p_userdata A pointer to arbitrary data which will be passed to p_func.\n @param p_tasks The number of tasks needed in the group.\n @param p_high_priority Whether or not this is a high priority task.\n @param p_description A pointer to a String with the task description.\n\n @return The task group ID.\n\n @see WorkerThreadPool::add_group_task()"]
pub type GDExtensionInterfaceWorkerThreadPoolAddNativeGroupTask = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionObjectPtr,
        p_func: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: u32),
        >,
        p_userdata: *mut ::std::os::raw::c_void,
        p_elements: ::std::os::raw::c_int,
        p_tasks: ::std::os::raw::c_int,
        p_high_priority: GDExtensionBool,
        p_description: GDExtensionConstStringPtr,
    ) -> i64,
>;
#[doc = " @name worker_thread_pool_add_native_task\n @since 4.1\n\n Adds a task to an instance of WorkerThreadPool.\n\n @param p_instance A pointer to a WorkerThreadPool object.\n @param p_func A pointer to a function to run in the thread pool.\n @param p_userdata A pointer to arbitrary data which will be passed to p_func.\n @param p_high_priority Whether or not this is a high priority task.\n @param p_description A pointer to a String with the task description.\n\n @return The task ID."]
pub type GDExtensionInterfaceWorkerThreadPoolAddNativeTask = ::std::option::Option<
    unsafe extern "C" fn(
        p_instance: GDExtensionObjectPtr,
        p_func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        p_userdata: *mut ::std::os::raw::c_void,
        p_high_priority: GDExtensionBool,
        p_description: GDExtensionConstStringPtr,
    ) -> i64,
>;
#[doc = " @name packed_byte_array_operator_index\n @since 4.1\n\n Gets a pointer to a byte in a PackedByteArray.\n\n @param p_self A pointer to a PackedByteArray object.\n @param p_index The index of the byte to get.\n\n @return A pointer to the requested byte."]
pub type GDExtensionInterfacePackedByteArrayOperatorIndex = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionTypePtr, p_index: GDExtensionInt) -> *mut u8,
>;
#[doc = " @name packed_byte_array_operator_index_const\n @since 4.1\n\n Gets a const pointer to a byte in a PackedByteArray.\n\n @param p_self A const pointer to a PackedByteArray object.\n @param p_index The index of the byte to get.\n\n @return A const pointer to the requested byte."]
pub type GDExtensionInterfacePackedByteArrayOperatorIndexConst = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionConstTypePtr, p_index: GDExtensionInt) -> *const u8,
>;
#[doc = " @name packed_color_array_operator_index\n @since 4.1\n\n Gets a pointer to a color in a PackedColorArray.\n\n @param p_self A pointer to a PackedColorArray object.\n @param p_index The index of the Color to get.\n\n @return A pointer to the requested Color."]
pub type GDExtensionInterfacePackedColorArrayOperatorIndex = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionTypePtr, p_index: GDExtensionInt) -> GDExtensionTypePtr,
>;
#[doc = " @name packed_color_array_operator_index_const\n @since 4.1\n\n Gets a const pointer to a color in a PackedColorArray.\n\n @param p_self A const pointer to a const PackedColorArray object.\n @param p_index The index of the Color to get.\n\n @return A const pointer to the requested Color."]
pub type GDExtensionInterfacePackedColorArrayOperatorIndexConst = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstTypePtr,
        p_index: GDExtensionInt,
    ) -> GDExtensionTypePtr,
>;
#[doc = " @name packed_float32_array_operator_index\n @since 4.1\n\n Gets a pointer to a 32-bit float in a PackedFloat32Array.\n\n @param p_self A pointer to a PackedFloat32Array object.\n @param p_index The index of the float to get.\n\n @return A pointer to the requested 32-bit float."]
pub type GDExtensionInterfacePackedFloat32ArrayOperatorIndex = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionTypePtr, p_index: GDExtensionInt) -> *mut f32,
>;
#[doc = " @name packed_float32_array_operator_index_const\n @since 4.1\n\n Gets a const pointer to a 32-bit float in a PackedFloat32Array.\n\n @param p_self A const pointer to a PackedFloat32Array object.\n @param p_index The index of the float to get.\n\n @return A const pointer to the requested 32-bit float."]
pub type GDExtensionInterfacePackedFloat32ArrayOperatorIndexConst = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionConstTypePtr, p_index: GDExtensionInt) -> *const f32,
>;
#[doc = " @name packed_float64_array_operator_index\n @since 4.1\n\n Gets a pointer to a 64-bit float in a PackedFloat64Array.\n\n @param p_self A pointer to a PackedFloat64Array object.\n @param p_index The index of the float to get.\n\n @return A pointer to the requested 64-bit float."]
pub type GDExtensionInterfacePackedFloat64ArrayOperatorIndex = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionTypePtr, p_index: GDExtensionInt) -> *mut f64,
>;
#[doc = " @name packed_float64_array_operator_index_const\n @since 4.1\n\n Gets a const pointer to a 64-bit float in a PackedFloat64Array.\n\n @param p_self A const pointer to a PackedFloat64Array object.\n @param p_index The index of the float to get.\n\n @return A const pointer to the requested 64-bit float."]
pub type GDExtensionInterfacePackedFloat64ArrayOperatorIndexConst = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionConstTypePtr, p_index: GDExtensionInt) -> *const f64,
>;
#[doc = " @name packed_int32_array_operator_index\n @since 4.1\n\n Gets a pointer to a 32-bit integer in a PackedInt32Array.\n\n @param p_self A pointer to a PackedInt32Array object.\n @param p_index The index of the integer to get.\n\n @return A pointer to the requested 32-bit integer."]
pub type GDExtensionInterfacePackedInt32ArrayOperatorIndex = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionTypePtr, p_index: GDExtensionInt) -> *mut i32,
>;
#[doc = " @name packed_int32_array_operator_index_const\n @since 4.1\n\n Gets a const pointer to a 32-bit integer in a PackedInt32Array.\n\n @param p_self A const pointer to a PackedInt32Array object.\n @param p_index The index of the integer to get.\n\n @return A const pointer to the requested 32-bit integer."]
pub type GDExtensionInterfacePackedInt32ArrayOperatorIndexConst = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionConstTypePtr, p_index: GDExtensionInt) -> *const i32,
>;
#[doc = " @name packed_int64_array_operator_index\n @since 4.1\n\n Gets a pointer to a 64-bit integer in a PackedInt64Array.\n\n @param p_self A pointer to a PackedInt64Array object.\n @param p_index The index of the integer to get.\n\n @return A pointer to the requested 64-bit integer."]
pub type GDExtensionInterfacePackedInt64ArrayOperatorIndex = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionTypePtr, p_index: GDExtensionInt) -> *mut i64,
>;
#[doc = " @name packed_int64_array_operator_index_const\n @since 4.1\n\n Gets a const pointer to a 64-bit integer in a PackedInt64Array.\n\n @param p_self A const pointer to a PackedInt64Array object.\n @param p_index The index of the integer to get.\n\n @return A const pointer to the requested 64-bit integer."]
pub type GDExtensionInterfacePackedInt64ArrayOperatorIndexConst = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionConstTypePtr, p_index: GDExtensionInt) -> *const i64,
>;
#[doc = " @name packed_string_array_operator_index\n @since 4.1\n\n Gets a pointer to a string in a PackedStringArray.\n\n @param p_self A pointer to a PackedStringArray object.\n @param p_index The index of the String to get.\n\n @return A pointer to the requested String."]
pub type GDExtensionInterfacePackedStringArrayOperatorIndex = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionTypePtr,
        p_index: GDExtensionInt,
    ) -> GDExtensionStringPtr,
>;
#[doc = " @name packed_string_array_operator_index_const\n @since 4.1\n\n Gets a const pointer to a string in a PackedStringArray.\n\n @param p_self A const pointer to a PackedStringArray object.\n @param p_index The index of the String to get.\n\n @return A const pointer to the requested String."]
pub type GDExtensionInterfacePackedStringArrayOperatorIndexConst = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstTypePtr,
        p_index: GDExtensionInt,
    ) -> GDExtensionStringPtr,
>;
#[doc = " @name packed_vector2_array_operator_index\n @since 4.1\n\n Gets a pointer to a Vector2 in a PackedVector2Array.\n\n @param p_self A pointer to a PackedVector2Array object.\n @param p_index The index of the Vector2 to get.\n\n @return A pointer to the requested Vector2."]
pub type GDExtensionInterfacePackedVector2ArrayOperatorIndex = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionTypePtr, p_index: GDExtensionInt) -> GDExtensionTypePtr,
>;
#[doc = " @name packed_vector2_array_operator_index_const\n @since 4.1\n\n Gets a const pointer to a Vector2 in a PackedVector2Array.\n\n @param p_self A const pointer to a PackedVector2Array object.\n @param p_index The index of the Vector2 to get.\n\n @return A const pointer to the requested Vector2."]
pub type GDExtensionInterfacePackedVector2ArrayOperatorIndexConst = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstTypePtr,
        p_index: GDExtensionInt,
    ) -> GDExtensionTypePtr,
>;
#[doc = " @name packed_vector3_array_operator_index\n @since 4.1\n\n Gets a pointer to a Vector3 in a PackedVector3Array.\n\n @param p_self A pointer to a PackedVector3Array object.\n @param p_index The index of the Vector3 to get.\n\n @return A pointer to the requested Vector3."]
pub type GDExtensionInterfacePackedVector3ArrayOperatorIndex = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionTypePtr, p_index: GDExtensionInt) -> GDExtensionTypePtr,
>;
#[doc = " @name packed_vector3_array_operator_index_const\n @since 4.1\n\n Gets a const pointer to a Vector3 in a PackedVector3Array.\n\n @param p_self A const pointer to a PackedVector3Array object.\n @param p_index The index of the Vector3 to get.\n\n @return A const pointer to the requested Vector3."]
pub type GDExtensionInterfacePackedVector3ArrayOperatorIndexConst = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstTypePtr,
        p_index: GDExtensionInt,
    ) -> GDExtensionTypePtr,
>;
#[doc = " @name array_operator_index\n @since 4.1\n\n Gets a pointer to a Variant in an Array.\n\n @param p_self A pointer to an Array object.\n @param p_index The index of the Variant to get.\n\n @return A pointer to the requested Variant."]
pub type GDExtensionInterfaceArrayOperatorIndex = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionTypePtr,
        p_index: GDExtensionInt,
    ) -> GDExtensionVariantPtr,
>;
#[doc = " @name array_operator_index_const\n @since 4.1\n\n Gets a const pointer to a Variant in an Array.\n\n @param p_self A const pointer to an Array object.\n @param p_index The index of the Variant to get.\n\n @return A const pointer to the requested Variant."]
pub type GDExtensionInterfaceArrayOperatorIndexConst = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstTypePtr,
        p_index: GDExtensionInt,
    ) -> GDExtensionVariantPtr,
>;
#[doc = " @name array_ref\n @since 4.1\n\n Sets an Array to be a reference to another Array object.\n\n @param p_self A pointer to the Array object to update.\n @param p_from A pointer to the Array object to reference."]
pub type GDExtensionInterfaceArrayRef = ::std::option::Option<
    unsafe extern "C" fn(p_self: GDExtensionTypePtr, p_from: GDExtensionConstTypePtr),
>;
#[doc = " @name array_set_typed\n @since 4.1\n\n Makes an Array into a typed Array.\n\n @param p_self A pointer to the Array.\n @param p_type The type of Variant the Array will store.\n @param p_class_name A pointer to a StringName with the name of the object (if p_type is GDEXTENSION_VARIANT_TYPE_OBJECT).\n @param p_script A pointer to a Script object (if p_type is GDEXTENSION_VARIANT_TYPE_OBJECT and the base class is extended by a script)."]
pub type GDExtensionInterfaceArraySetTyped = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionTypePtr,
        p_type: GDExtensionVariantType,
        p_class_name: GDExtensionConstStringNamePtr,
        p_script: GDExtensionConstVariantPtr,
    ),
>;
#[doc = " @name dictionary_operator_index\n @since 4.1\n\n Gets a pointer to a Variant in a Dictionary with the given key.\n\n @param p_self A pointer to a Dictionary object.\n @param p_key A pointer to a Variant representing the key.\n\n @return A pointer to a Variant representing the value at the given key."]
pub type GDExtensionInterfaceDictionaryOperatorIndex = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionTypePtr,
        p_key: GDExtensionConstVariantPtr,
    ) -> GDExtensionVariantPtr,
>;
#[doc = " @name dictionary_operator_index_const\n @since 4.1\n\n Gets a const pointer to a Variant in a Dictionary with the given key.\n\n @param p_self A const pointer to a Dictionary object.\n @param p_key A pointer to a Variant representing the key.\n\n @return A const pointer to a Variant representing the value at the given key."]
pub type GDExtensionInterfaceDictionaryOperatorIndexConst = ::std::option::Option<
    unsafe extern "C" fn(
        p_self: GDExtensionConstTypePtr,
        p_key: GDExtensionConstVariantPtr,
    ) -> GDExtensionVariantPtr,
>;
#[doc = " @name object_method_bind_call\n @since 4.1\n\n Calls a method on an Object.\n\n @param p_method_bind A pointer to the MethodBind representing the method on the Object's class.\n @param p_instance A pointer to the Object.\n @param p_args A pointer to a C array of Variants representing the arguments.\n @param p_arg_count The number of arguments.\n @param r_ret A pointer to Variant which will receive the return value.\n @param r_error A pointer to a GDExtensionCallError struct that will receive error information."]
pub type GDExtensionInterfaceObjectMethodBindCall = ::std::option::Option<
    unsafe extern "C" fn(
        p_method_bind: GDExtensionMethodBindPtr,
        p_instance: GDExtensionObjectPtr,
        p_args: *const GDExtensionConstVariantPtr,
        p_arg_count: GDExtensionInt,
        r_ret: GDExtensionUninitializedVariantPtr,
        r_error: *mut GDExtensionCallError,
    ),
>;
#[doc = " @name object_method_bind_ptrcall\n @since 4.1\n\n Calls a method on an Object (using a \"ptrcall\").\n\n @param p_method_bind A pointer to the MethodBind representing the method on the Object's class.\n @param p_instance A pointer to the Object.\n @param p_args A pointer to a C array representing the arguments.\n @param r_ret A pointer to the Object that will receive the return value."]
pub type GDExtensionInterfaceObjectMethodBindPtrcall = ::std::option::Option<
    unsafe extern "C" fn(
        p_method_bind: GDExtensionMethodBindPtr,
        p_instance: GDExtensionObjectPtr,
        p_args: *const GDExtensionConstTypePtr,
        r_ret: GDExtensionTypePtr,
    ),
>;
#[doc = " @name object_destroy\n @since 4.1\n\n Destroys an Object.\n\n @param p_o A pointer to the Object."]
pub type GDExtensionInterfaceObjectDestroy =
    ::std::option::Option<unsafe extern "C" fn(p_o: GDExtensionObjectPtr)>;
#[doc = " @name global_get_singleton\n @since 4.1\n\n Gets a global singleton by name.\n\n @param p_name A pointer to a StringName with the singleton name.\n\n @return A pointer to the singleton Object."]
pub type GDExtensionInterfaceGlobalGetSingleton = ::std::option::Option<
    unsafe extern "C" fn(p_name: GDExtensionConstStringNamePtr) -> GDExtensionObjectPtr,
>;
#[doc = " @name object_get_instance_binding\n @since 4.1\n\n Gets a pointer representing an Object's instance binding.\n\n @param p_o A pointer to the Object.\n @param p_library A token the library received by the GDExtension's entry point function.\n @param p_callbacks A pointer to a GDExtensionInstanceBindingCallbacks struct.\n\n @return"]
pub type GDExtensionInterfaceObjectGetInstanceBinding = ::std::option::Option<
    unsafe extern "C" fn(
        p_o: GDExtensionObjectPtr,
        p_token: *mut ::std::os::raw::c_void,
        p_callbacks: *const GDExtensionInstanceBindingCallbacks,
    ) -> *mut ::std::os::raw::c_void,
>;
#[doc = " @name object_set_instance_binding\n @since 4.1\n\n Sets an Object's instance binding.\n\n @param p_o A pointer to the Object.\n @param p_library A token the library received by the GDExtension's entry point function.\n @param p_binding A pointer to the instance binding.\n @param p_callbacks A pointer to a GDExtensionInstanceBindingCallbacks struct."]
pub type GDExtensionInterfaceObjectSetInstanceBinding = ::std::option::Option<
    unsafe extern "C" fn(
        p_o: GDExtensionObjectPtr,
        p_token: *mut ::std::os::raw::c_void,
        p_binding: *mut ::std::os::raw::c_void,
        p_callbacks: *const GDExtensionInstanceBindingCallbacks,
    ),
>;
#[doc = " @name object_set_instance\n @since 4.1\n\n Sets an extension class instance on a Object.\n\n @param p_o A pointer to the Object.\n @param p_classname A pointer to a StringName with the registered extension class's name.\n @param p_instance A pointer to the extension class instance."]
pub type GDExtensionInterfaceObjectSetInstance = ::std::option::Option<
    unsafe extern "C" fn(
        p_o: GDExtensionObjectPtr,
        p_classname: GDExtensionConstStringNamePtr,
        p_instance: GDExtensionClassInstancePtr,
    ),
>;
#[doc = " @name object_get_class_name\n @since 4.1\n\n Gets the class name of an Object.\n\n @param p_object A pointer to the Object.\n @param p_library A pointer the library received by the GDExtension's entry point function.\n @param r_class_name A pointer to a String to receive the class name.\n\n @return true if successful in getting the class name; otherwise false."]
pub type GDExtensionInterfaceObjectGetClassName = ::std::option::Option<
    unsafe extern "C" fn(
        p_object: GDExtensionConstObjectPtr,
        p_library: GDExtensionClassLibraryPtr,
        r_class_name: GDExtensionUninitializedStringNamePtr,
    ) -> GDExtensionBool,
>;
#[doc = " @name object_cast_to\n @since 4.1\n\n Casts an Object to a different type.\n\n @param p_object A pointer to the Object.\n @param p_class_tag A pointer uniquely identifying a built-in class in the ClassDB.\n\n @return Returns a pointer to the Object, or NULL if it can't be cast to the requested type."]
pub type GDExtensionInterfaceObjectCastTo = ::std::option::Option<
    unsafe extern "C" fn(
        p_object: GDExtensionConstObjectPtr,
        p_class_tag: *mut ::std::os::raw::c_void,
    ) -> GDExtensionObjectPtr,
>;
#[doc = " @name object_get_instance_from_id\n @since 4.1\n\n Gets an Object by its instance ID.\n\n @param p_instance_id The instance ID.\n\n @return A pointer to the Object."]
pub type GDExtensionInterfaceObjectGetInstanceFromId = ::std::option::Option<
    unsafe extern "C" fn(p_instance_id: GDObjectInstanceID) -> GDExtensionObjectPtr,
>;
#[doc = " @name object_get_instance_id\n @since 4.1\n\n Gets the instance ID from an Object.\n\n @param p_object A pointer to the Object.\n\n @return The instance ID."]
pub type GDExtensionInterfaceObjectGetInstanceId = ::std::option::Option<
    unsafe extern "C" fn(p_object: GDExtensionConstObjectPtr) -> GDObjectInstanceID,
>;
#[doc = " @name ref_get_object\n @since 4.1\n\n Gets the Object from a reference.\n\n @param p_ref A pointer to the reference.\n\n @return A pointer to the Object from the reference or NULL."]
pub type GDExtensionInterfaceRefGetObject = ::std::option::Option<
    unsafe extern "C" fn(p_ref: GDExtensionConstRefPtr) -> GDExtensionObjectPtr,
>;
#[doc = " @name ref_set_object\n @since 4.1\n\n Sets the Object referred to by a reference.\n\n @param p_ref A pointer to the reference.\n @param p_object A pointer to the Object to refer to."]
pub type GDExtensionInterfaceRefSetObject = ::std::option::Option<
    unsafe extern "C" fn(p_ref: GDExtensionRefPtr, p_object: GDExtensionObjectPtr),
>;
#[doc = " @name script_instance_create\n @since 4.1\n\n Creates a script instance that contains the given info and instance data.\n\n @param p_info A pointer to a GDExtensionScriptInstanceInfo struct.\n @param p_instance_data A pointer to a data representing the script instance in the GDExtension. This will be passed to all the function pointers on p_info.\n\n @return A pointer to a ScriptInstanceExtension object."]
pub type GDExtensionInterfaceScriptInstanceCreate = ::std::option::Option<
    unsafe extern "C" fn(
        p_info: *const GDExtensionScriptInstanceInfo,
        p_instance_data: GDExtensionScriptInstanceDataPtr,
    ) -> GDExtensionScriptInstancePtr,
>;
#[doc = " @name classdb_construct_object\n @since 4.1\n\n Constructs an Object of the requested class.\n\n The passed class must be a built-in godot class, or an already-registered extension class. In both cases, object_set_instance() should be called to fully initialize the object.\n\n @param p_classname A pointer to a StringName with the class name.\n\n @return A pointer to the newly created Object."]
pub type GDExtensionInterfaceClassdbConstructObject = ::std::option::Option<
    unsafe extern "C" fn(p_classname: GDExtensionConstStringNamePtr) -> GDExtensionObjectPtr,
>;
#[doc = " @name classdb_get_method_bind\n @since 4.1\n\n Gets a pointer to the MethodBind in ClassDB for the given class, method and hash.\n\n @param p_classname A pointer to a StringName with the class name.\n @param p_methodname A pointer to a StringName with the method name.\n @param p_hash A hash representing the function signature.\n\n @return A pointer to the MethodBind from ClassDB."]
pub type GDExtensionInterfaceClassdbGetMethodBind = ::std::option::Option<
    unsafe extern "C" fn(
        p_classname: GDExtensionConstStringNamePtr,
        p_methodname: GDExtensionConstStringNamePtr,
        p_hash: GDExtensionInt,
    ) -> GDExtensionMethodBindPtr,
>;
#[doc = " @name classdb_get_class_tag\n @since 4.1\n\n Gets a pointer uniquely identifying the given built-in class in the ClassDB.\n\n @param p_classname A pointer to a StringName with the class name.\n\n @return A pointer uniquely identifying the built-in class in the ClassDB."]
pub type GDExtensionInterfaceClassdbGetClassTag = ::std::option::Option<
    unsafe extern "C" fn(p_classname: GDExtensionConstStringNamePtr) -> *mut ::std::os::raw::c_void,
>;
#[doc = " @name classdb_register_extension_class\n @since 4.1\n\n Registers an extension class in the ClassDB.\n\n Provided struct can be safely freed once the function returns.\n\n @param p_library A pointer the library received by the GDExtension's entry point function.\n @param p_class_name A pointer to a StringName with the class name.\n @param p_parent_class_name A pointer to a StringName with the parent class name.\n @param p_extension_funcs A pointer to a GDExtensionClassCreationInfo struct."]
pub type GDExtensionInterfaceClassdbRegisterExtensionClass = ::std::option::Option<
    unsafe extern "C" fn(
        p_library: GDExtensionClassLibraryPtr,
        p_class_name: GDExtensionConstStringNamePtr,
        p_parent_class_name: GDExtensionConstStringNamePtr,
        p_extension_funcs: *const GDExtensionClassCreationInfo,
    ),
>;
#[doc = " @name classdb_register_extension_class_method\n @since 4.1\n\n Registers a method on an extension class in the ClassDB.\n\n Provided struct can be safely freed once the function returns.\n\n @param p_library A pointer the library received by the GDExtension's entry point function.\n @param p_class_name A pointer to a StringName with the class name.\n @param p_method_info A pointer to a GDExtensionClassMethodInfo struct."]
pub type GDExtensionInterfaceClassdbRegisterExtensionClassMethod = ::std::option::Option<
    unsafe extern "C" fn(
        p_library: GDExtensionClassLibraryPtr,
        p_class_name: GDExtensionConstStringNamePtr,
        p_method_info: *const GDExtensionClassMethodInfo,
    ),
>;
#[doc = " @name classdb_register_extension_class_integer_constant\n @since 4.1\n\n Registers an integer constant on an extension class in the ClassDB.\n\n @param p_library A pointer the library received by the GDExtension's entry point function.\n @param p_class_name A pointer to a StringName with the class name.\n @param p_enum_name A pointer to a StringName with the enum name.\n @param p_constant_name A pointer to a StringName with the constant name.\n @param p_constant_value The constant value.\n @param p_is_bitfield Whether or not this is a bit field."]
pub type GDExtensionInterfaceClassdbRegisterExtensionClassIntegerConstant = ::std::option::Option<
    unsafe extern "C" fn(
        p_library: GDExtensionClassLibraryPtr,
        p_class_name: GDExtensionConstStringNamePtr,
        p_enum_name: GDExtensionConstStringNamePtr,
        p_constant_name: GDExtensionConstStringNamePtr,
        p_constant_value: GDExtensionInt,
        p_is_bitfield: GDExtensionBool,
    ),
>;
#[doc = " @name classdb_register_extension_class_property\n @since 4.1\n\n Registers a property on an extension class in the ClassDB.\n\n Provided struct can be safely freed once the function returns.\n\n @param p_library A pointer the library received by the GDExtension's entry point function.\n @param p_class_name A pointer to a StringName with the class name.\n @param p_info A pointer to a GDExtensionPropertyInfo struct.\n @param p_setter A pointer to a StringName with the name of the setter method.\n @param p_getter A pointer to a StringName with the name of the getter method."]
pub type GDExtensionInterfaceClassdbRegisterExtensionClassProperty = ::std::option::Option<
    unsafe extern "C" fn(
        p_library: GDExtensionClassLibraryPtr,
        p_class_name: GDExtensionConstStringNamePtr,
        p_info: *const GDExtensionPropertyInfo,
        p_setter: GDExtensionConstStringNamePtr,
        p_getter: GDExtensionConstStringNamePtr,
    ),
>;
#[doc = " @name classdb_register_extension_class_property_group\n @since 4.1\n\n Registers a property group on an extension class in the ClassDB.\n\n @param p_library A pointer the library received by the GDExtension's entry point function.\n @param p_class_name A pointer to a StringName with the class name.\n @param p_group_name A pointer to a String with the group name.\n @param p_prefix A pointer to a String with the prefix used by properties in this group."]
pub type GDExtensionInterfaceClassdbRegisterExtensionClassPropertyGroup = ::std::option::Option<
    unsafe extern "C" fn(
        p_library: GDExtensionClassLibraryPtr,
        p_class_name: GDExtensionConstStringNamePtr,
        p_group_name: GDExtensionConstStringPtr,
        p_prefix: GDExtensionConstStringPtr,
    ),
>;
#[doc = " @name classdb_register_extension_class_property_subgroup\n @since 4.1\n\n Registers a property subgroup on an extension class in the ClassDB.\n\n @param p_library A pointer the library received by the GDExtension's entry point function.\n @param p_class_name A pointer to a StringName with the class name.\n @param p_subgroup_name A pointer to a String with the subgroup name.\n @param p_prefix A pointer to a String with the prefix used by properties in this subgroup."]
pub type GDExtensionInterfaceClassdbRegisterExtensionClassPropertySubgroup = ::std::option::Option<
    unsafe extern "C" fn(
        p_library: GDExtensionClassLibraryPtr,
        p_class_name: GDExtensionConstStringNamePtr,
        p_subgroup_name: GDExtensionConstStringPtr,
        p_prefix: GDExtensionConstStringPtr,
    ),
>;
#[doc = " @name classdb_register_extension_class_signal\n @since 4.1\n\n Registers a signal on an extension class in the ClassDB.\n\n Provided structs can be safely freed once the function returns.\n\n @param p_library A pointer the library received by the GDExtension's entry point function.\n @param p_class_name A pointer to a StringName with the class name.\n @param p_signal_name A pointer to a StringName with the signal name.\n @param p_argument_info A pointer to a GDExtensionPropertyInfo struct.\n @param p_argument_count The number of arguments the signal receives."]
pub type GDExtensionInterfaceClassdbRegisterExtensionClassSignal = ::std::option::Option<
    unsafe extern "C" fn(
        p_library: GDExtensionClassLibraryPtr,
        p_class_name: GDExtensionConstStringNamePtr,
        p_signal_name: GDExtensionConstStringNamePtr,
        p_argument_info: *const GDExtensionPropertyInfo,
        p_argument_count: GDExtensionInt,
    ),
>;
#[doc = " @name classdb_unregister_extension_class\n @since 4.1\n\n Unregisters an extension class in the ClassDB.\n\n @param p_library A pointer the library received by the GDExtension's entry point function.\n @param p_class_name A pointer to a StringName with the class name."]
pub type GDExtensionInterfaceClassdbUnregisterExtensionClass = ::std::option::Option<
    unsafe extern "C" fn(
        p_library: GDExtensionClassLibraryPtr,
        p_class_name: GDExtensionConstStringNamePtr,
    ),
>;
#[doc = " @name get_library_path\n @since 4.1\n\n Gets the path to the current GDExtension library.\n\n @param p_library A pointer the library received by the GDExtension's entry point function.\n @param r_path A pointer to a String which will receive the path."]
pub type GDExtensionInterfaceGetLibraryPath = ::std::option::Option<
    unsafe extern "C" fn(
        p_library: GDExtensionClassLibraryPtr,
        r_path: GDExtensionUninitializedStringPtr,
    ),
>;
#[doc = " @name editor_add_plugin\n @since 4.1\n\n Adds an editor plugin.\n\n It's safe to call during initialization.\n\n @param p_class_name A pointer to a StringName with the name of a class (descending from EditorPlugin) which is already registered with ClassDB."]
pub type GDExtensionInterfaceEditorAddPlugin =
    ::std::option::Option<unsafe extern "C" fn(p_class_name: GDExtensionConstStringNamePtr)>;
#[doc = " @name editor_remove_plugin\n @since 4.1\n\n Removes an editor plugin.\n\n @param p_class_name A pointer to a StringName with the name of a class that was previously added as an editor plugin."]
pub type GDExtensionInterfaceEditorRemovePlugin =
    ::std::option::Option<unsafe extern "C" fn(p_class_name: GDExtensionConstStringNamePtr)>;
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout___va_list_tag() {
    const UNINIT: ::std::mem::MaybeUninit<__va_list_tag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__va_list_tag>(),
        24usize,
        concat!("Size of: ", stringify!(__va_list_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__va_list_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__va_list_tag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(gp_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_offset) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(fp_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).overflow_arg_area) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(overflow_arg_area)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reg_save_area) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(reg_save_area)
        )
    );
}
